{"bill":{"bill_id":1257342,"change_hash":"3379ff0e36d3e98928900ec8c2e3f94f","session_id":1658,"session":{"session_id":1658,"state_id":52,"year_start":2019,"year_end":2020,"prefile":0,"sine_die":1,"prior":1,"special":0,"session_tag":"Regular Session","session_title":"2019-2020 Regular Session","session_name":"116th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/HB2546\/2019","state_link":"https:\/\/www.congress.gov\/bill\/116th-congress\/house-bill\/2546\/all-info","completed":0,"status":2,"status_date":"2020-02-13","progress":[{"date":"2019-05-07","event":1},{"date":"2019-05-07","event":9},{"date":"2019-05-16","event":9},{"date":"2019-11-20","event":10},{"date":"2020-02-13","event":2}],"state":"US","state_id":52,"bill_number":"HB2546","bill_type":"B","bill_type_id":"1","body":"H","body_id":114,"current_body":"S","current_body_id":115,"title":"Protecting America's Wilderness Act","description":"Designates wilderness areas, potential wilderness areas, recreation areas, scenic areas, trails, and wild and scenic rivers in Colorado, California, and Washington, among other things. TITLE I--COLORADO WILDERNESS Colorado Wilderness Act of 2020 (Sec. 102) The bill designates specified federal lands in Colorado as wilderness and as components of the National Wilderness Preservation System. If the Bureau of Reclamation determines that lands within the West Elk Wilderness Addition are necessary for the future expansion of the Blue Mesa Reservoir, the boundary must be revised. Lands within the exterior boundaries of any designated wilderness area that are owned by a private entity or by Colorado are included in the wilderness area if such lands are acquired by the United States. These lands may be acquired only as provided in the Wilderness Act. (Sec. 103) The grazing of livestock in the wilderness areas designated by this title shall be administered according to certain provisions of the Wilderness Act and the guidelines set forth in a certain House report. The Colorado Army National Guard, through the High-Altitude Army National Guard Aviation Training Site, may conduct aerial navigation training maneuver exercises over the potential wilderness areas designated by this bill. The Bureau of Land Management (BLM) may continue authorizing competitive running events currently permitted in the Redcloud Peak Wilderness and Handies Peak Wilderness Areas. Federal land that is traded for privately owned land within the perimeter of the Redcloud Peak Wilderness or the Handies Peak Wilderness Areas shall be located in Hinsdale County, Colorado. The bill designates specified lands managed by the BLM as the Pisgah East Wilderness, the Pisgah West Wilderness, or the Flat Tops Wilderness upon publication by the BLM of a notice in the Federal Register that all nonconforming uses of such lands authorized by this bill have ceased. (Sec. 104) The bill provides for the securing, adjudication, and use of U.S. water rights for certain of the wilderness areas designated by this title. (Sec. 106) The Department of Defense shall study the impacts that the expansion of wilderness designations in the Western United States would have on the readiness of the Armed Forces with respect to aviation training. TITLE II--NORTHWEST CALIFORNIA WILDERNESS, RECREATION, AND WORKING FORESTS Northwest California Wilderness, Recreation, and Working Forests Act Subtitle A--Restoration and Economic Development (Sec. 211) The bill establishes the South Fork Trinity-Mad River Restoration Area, which shall comprise approximately 729,089 acres of federal land administered by the Forest Service and approximately 1,280 acres of federal land administered by the BLM. In the restoration area, the agencies shall prioritize restoration activities, may use prescribed burning and managed wildland fire, and shall decommission identified unneeded National Forest System roads and identified unauthorized roads. The agencies may conduct vegetation management projects in areas of the restoration area only where necessary to, among other things, maintain or restore the characteristics of ecosystem composition and structure. The projects may be (1) in areas in which fish and wildlife habitat is significantly compromised as a result of past management practices (including plantations), and (2) within designated riparian reserves only where necessary to maintain the integrity of fuel breaks and to enhance fire resilience. The agencies must use the best available science in planning and implementing the projects. The bill permits the grazing of livestock in the restoration area, where already established, to continue. The agencies may issue annual targeted grazing permits for livestock grazing, where not already established, to control noxious weeds, to aid in the control of wildfire within the wildland-urban interface, or to provide other ecological benefits. The agencies must use the best available science when determining whether to issue such permits. The bill withdraws the restoration area from entry, appropriation, and disposal under the public land laws; location, entry, and patent under the mining laws; and disposition under all laws relating to mineral and geothermal leasing or mineral materials. The agencies shall use stewardship contracts to implement this section; and use revenue derived from such stewardship contracts for restoration and other activities within the restoration area, including staff and administrative costs to support consultation activities for restoration projects. Collaboratively developed restoration projects within the restoration area may be carried out in accordance with the provisions for hazardous fuel reduction projects under the Healthy Forests Restoration Act of 2003. The Forest Service shall in collaboration with the BLM and interested persons, use a multiparty monitoring, evaluation, and accountability process to assess the positive or negative ecological, social, and economic effects of restoration projects within the restoration area; and incorporate the monitoring results into the management of the restoration area. The agencies may use forest residues from restoration projects, including shaded fuel breaks, in the restoration area for research and development of biobased products that result in net carbon sequestration. (Sec. 212) The Department of the Interior is authorized to undertake initiatives to restore degraded redwood forest ecosystems in Redwood National and State Parks in partnership with California, local agencies, and nongovernmental organizations. (Sec. 213) The bill establishes the California Public Lands Remediation Partnership to coordinate the activities of federal, state, tribal, and local authorities and the private sector in the remediation of high priority lands in California affected by illegal marijuana cultivation or other illegal activities; and use the resources and expertise of each agency, authority, or entity in implementing the activities. The Department of Agriculture (USDA) shall convene the partnership on a regular basis to carry out this section. USDA and Interior may provide technical and financial assistance to the partnership or any members of the partnership to carry out this title. (Sec. 214) The Forest Service may establish a visitor center in Weaverville, California, to serve visitors and to assist in fulfilling the purposes of the Whiskeytown-Shasta-Trinity National Recreation Area. The visitor center must be designed to interpret the resources of the recreation area and other nearby federal lands. (Sec. 215) USDA and Interior may establish a visitor center in Del Norte County, California, to serve visitors and to assist in fulfilling the purposes of Redwood National and State Parks, the Smith River National Recreation Area, and other nearby federal lands. (Sec. 216) In revising the land and resource management plan for the Shasta-Trinity, Six Rivers, Klamath, and Mendocino National Forests, the Forest Service shall consider the purposes of the South Fork Trinity-Mad River Restoration Area, and include or update the fire management plans for the wilderness areas and wilderness additions established by this title. (Sec. 217) Interior shall study the feasibility and suitability of establishing overnight accommodations near the northern and southern boundaries of the Redwood National and State Parks. If the study determines that establishing the accommodations is suitable and feasible, Interior may enter into agreements with qualified private and nonprofit organizations for the development, operation, and maintenance of such accommodations. Subtitle B--Recreation (Sec. 221) The bill establishes the Horse Mountain Special Management Area, which comprises 7,399 acres of federal land administered by the Forest Service in Humboldt County in California, to enhance the recreational and scenic values of the special management area while conserving the plants, wildlife, and other natural resource values of such area. The Forest Service must develop a comprehensive plan for the long-term management of the special management area. The management plan shall ensure that recreational use within the special management area does not cause significant adverse impacts on the plants and wildlife of such area. The Forest Service shall continue to authorize, maintain, and enhance the recreational use of the special management area. The use of motorized vehicles in the special management area shall be permitted only on roads and trails designated for their use, except for the winter use of snowmobiles during periods of adequate snow coverage. The Forest Service may construct new trails for motorized or nonmotorized recreation within the special management area. In establishing such trails, the Forest Service shall prioritize the establishment of loops that provide high-quality, diverse recreational experiences. The bill withdraws the special management area from appropriation or disposal under the public land laws; location, entry, and patent under the mining laws; and disposition under laws related to mineral and geothermal leasing. (Sec. 222) USDA, in cooperation with Interior, shall study the feasibility of establishing a nonmotorized Bigfoot National Recreation Trail that shall extend from the Ides Cove Trailhead in the Mendocino National Forest to Crescent City, California. Upon a determination that the Bigfoot National Recreation Trail is feasible and meets the requirements for a National Recreation Trail, USDA shall then designate the recreation trail in accordance with the National Trails System Act, this title, and other applicable law. The bill bars any portion of the trail from being located on nonfederal land without the landowner's written consent. USDA must not acquire for the trail any land or interest in land outside of the exterior boundary of any federally managed area without the owner's consent. (Sec. 223) The Forest Service shall designate an Elk Camp Ridge Recreation Trail, which may include a system of trails, on its land in Del Norte County that is authorized for use by off-highway vehicles, mountain bicycles, or both. In order to minimize the impacts of the use of the trail on environmental and cultural resources, the Forest Service shall annually assess the effects of the use of off-highway vehicles and mountain bicycles on the trail, land located in proximity to the trail, plants, wildlife, and wildlife habitat. (Sec. 224) The Forest Service may construct a recreational trail for nonmotorized uses around Trinity Lake if it determines construction of the trail is feasible and in the public interest. The trail may be constructed through the acceptance of volunteer services and contributions from nonfederal sources to reduce or eliminate the need for federal expenditures to construct the trail. (Sec. 225) The Forest Service shall conduct a study to improve motorized and nonmotorized recreation trail opportunities (including mountain bicycling) on land not designated as wilderness within portions of the Six Rivers, Shasta-Trinity, and Mendocino National Forests located in Del Norte, Humboldt, Trinity, and Mendocino Counties. (Sec. 226) The Forest Service may construct recreational trails for mountain bicycling and other nonmotorized uses on the routes generally depicted in the report titled Trail Study for Smith River National Recreation Area Six Rivers National Forest and dated 2016, if the Forest Service determines construction is feasible and in the public interest. The trail may be constructed through the acceptance of volunteer services and contributions from nonfederal sources to reduce or eliminate the need for federal expenditures to construct the route. (Sec. 227) Interior or USDA may enter into agreements with qualified private and nonprofit organizations to undertake the following activities on federal lands in Mendocino, Humboldt, Trinity, and Del Norte Counties: trail and campground maintenance; public education, visitor contracts, and outreach; and visitor center staffing. Subtitle C--Conservation (Sec. 231) The bill designates certain federal lands in California as wilderness areas and as components of the National Wilderness Preservation System. The bill redesignates the North Fork Wilderness as the North Fork Eel River Wilderness. The bill adjusts the boundary of the Elkhorn Ridge Wilderness by deleting approximately 30 acres of federal land. (Sec. 232) The Forest Service and BLM may take measures in such a designated wilderness or wilderness addition as are necessary to control fire, insects, and diseases. To ensure a timely and efficient response to fire emergencies in the wilderness additions designated by this subtitle, USDA shall establish agency approval procedures for responding to fire emergencies, and enter into agreements with state or local firefighting agencies. The grazing of livestock in the wilderness areas and wilderness additions designated by this title, if already established, shall be administered in accordance with the Wilderness Act and specified guidelines. The wilderness areas and wilderness additions are withdrawn from entry, appropriation, and disposal under the public land laws; location, entry, and patent under the mining laws; and operation of the mineral materials and geothermal leasing laws. The agencies must ensure that Indian tribes have access to the wilderness areas and wilderness additions for traditional cultural and religious purposes. One or more specific portions of an area or addition may be temporarily closed to the public to protect the privacy of the members of a tribe when conducting traditional cultural and religious activities there. Any land within the boundary of a wilderness area or wilderness addition that is acquired by the United States shall become part of the area. The agencies may authorize the installation and maintenance of hydrologic, meteorologic, or climatological collection devices in the wilderness areas and wilderness additions if the facilities and access to them are essential to flood warning, flood control, or water reservoir operation activities. The Forest Service may continue to authorize the competitive equestrian event permitted since 2012 in the Chinquapin Wilderness in a manner that is compatible with the preservation of such area as wilderness. (Sec. 233) The bill designates certain federal lands in California as potential wilderness areas. The Forest Service or National Park Service, for purposes of ecological restoration, may use motorized equipment and mechanized transport in a potential wilderness area until it is designated as wilderness. The minimum tool or administrative practice necessary shall be used to accomplish ecological restoration with the least amount of adverse impact. A potential wilderness shall be designated as wilderness and as a component of the National Wilderness Preservation System on the earlier of when a notice has been published by the managing agency that the conditions in the area that are incompatible with the Wilderness Act have been removed, or it is 10 years after enactment of this bill for areas located on lands managed by the Forest Service. (Sec. 234) The bill designates specified river segments from the source tributaries in the Yolla Bolly-Middle Eel Wilderness as components of the National Wild and Scenic Rivers System. (Sec. 235) The bill establishes the Sanhedrin Special Conservation Management Area, comprising approximately 14,177 acres of federal land administered by the Forest Service in Mendocino County, California. The use of motorized vehicles shall be permitted in the conservation management area only on existing roads, trails, and areas designated for use by such vehicles. The bill prohibits the construction of any new or temporary roads within such area. The bill prohibits timber harvesting within the conservation management area unless the Forest Service authorizes it as necessary to further the purposes of such area. Livestock grazing, where already established, shall be permitted to continue in the conservation management area. The Forest Service may take any measures within the conservation management area that are necessary to control fire, insects, and diseases. The Forest Service may acquire by purchase from willing sellers, donation, or exchange, any land or interest in land within or adjacent to the boundaries of the conservation management area for incorporation into the area. All federal lands located within the conservation management area are withdrawn from entry, appropriation, and disposal under the public land laws; location, entry, and patent under the mining laws; and operation of the mineral leasing, mineral materials, and geothermal leasing laws. Subtitle D--Miscellaneous (Sec. 242) USDA and Interior shall incorporate the designations and studies required by this title into updated management plans for units covered by this title. TITLE III--CENTRAL COAST HERITAGE PROTECTION Central Coast Heritage Protection Act (Sec. 303) The bill designates specified lands in California administered by the BLM or the Forest Service as wilderness areas and as components of the National Wilderness Preservation System. (Sec. 304) The bill designates specified lands, comprising approximately 2,359 acres, as the Machesna Mountain Potential Wilderness. The Forest Service may reconstruct, realign, or reroute the Pine Mountain Trail. In carrying out such an activity, the Forest Service shall use the minimum tool or administrative practice necessary to accomplish the reconstruction, realignment, or rerouting with the least amount of adverse impact on wilderness character and resources. The Forest Service may permit the use of motorized and mechanized vehicles on the existing Pine Mountain Trail until the potential wilderness area is designated as wilderness. The federal lands in the potential wilderness area are withdrawn from entry, appropriation, or disposal under the public land laws; location, entry, and patent under the mining laws; and disposition under all laws pertaining to mineral and geothermal leasing or mineral materials. The Forest Service shall modify the boundary of the potential wilderness area to exclude any area within 150 feet of the centerline of the new location of any trail that has been reconstructed, realigned, or rerouted. The potential wilderness area, as modified, shall be designated as wilderness and as a component of the National Wilderness Preservation System on the earlier of when the Forest Service publishes a notice in the Federal Register that the reconstruction, realignment, or rerouting of the trail has been completed; or 20 years after enactment of this bill. Upon designation, the potential wilderness area shall become part of the Machesna Mountain Wilderness Area. (Sec. 305) The BLM or Forest Service may take any measures in a wilderness area as are necessary to control fire, insects, and diseases. Livestock grazing, if already established in the wilderness areas, shall be permitted to continue. The agencies may conduct management activities that are necessary to maintain or restore fish and wildlife populations and habitats in the wilderness areas. The wilderness areas are withdrawn from entry, appropriation, and disposal under the public land laws; location, entry, and patent under the mining laws; and disposition under all laws pertaining to mineral and geothermal leasing or mineral materials. Land within the boundary of a wilderness area which is acquired by the United States shall become part of the area in which the land is located. The agencies may authorize the installation and maintenance of hydrologic, meteorologic, or climatological collection devices in the wilderness areas if the facilities and access to them are essential to flood warning, flood control, or water reservoir operation activities. (Sec. 306) The bill designates specified river segments in California as components of the National Wild and Scenic Rivers System. (Sec. 307) The bill designates specified land in the Los Padres National Forest comprising approximately 41,082 acres, as the Fox Mountain Potential Wilderness Area. The Forest Service may construct a new trail for use by hikers, equestrians, and mechanized vehicles that connects the Aliso Park Campground to the Bull Ridge Trail; and reconstruct or realign the Bull Ridge Trail and the Rocky Ridge Trail. In carrying out any such activity, the Forest Service must use the minimum tool or administrative practice necessary to accomplish the construction, reconstruction, or alignment with the least amount of adverse impact on wilderness character and resources. The Forest Service may permit the use of mechanized vehicles on the existing Bull Ridge Trail and Rocky Ridge Trail until the potential wilderness area is designated as wilderness. The federal lands in the potential wilderness area are withdrawn from entry, appropriation, or disposal under the public land laws; location, entry, and patent under the mining laws; and disposition under all laws pertaining to mineral and geothermal leasing or mineral materials. The Forest Service shall modify the boundary of the potential wilderness area to exclude any area within 50 feet of the centerline of the new location of any trail that has been constructed, reconstructed, or realigned. The potential wilderness area, as modified, shall be designated as wilderness and as a component of the National Wilderness Preservation System on the earlier of when the department concerned publishes a notice in the Federal Register that trail construction, reconstruction, or alignment has been completed; or 20 years after the enactment of this bill. Upon designation, the potential wilderness shall become part of the San Rafael Wilderness. (Sec. 308) The bill establishes the Condor Ridge and Black Mountain Scenic Areas. The federal land in the scenic areas is withdrawn from entry, appropriation, or disposal under the public land laws; location, entry, and patent under the mining laws; and disposition under all laws pertaining to mineral and geothermal leasing or mineral materials. The following are prohibited on federal land within the scenic areas: permanent roads; permanent structures; timber harvesting, except when necessary to control fire, insects, and diseases; transmission lines; except as necessary to meet the minimum requirements for the administration of the scenic areas and to protect public health and safety, the use of motorized vehicles or the establishment of temporary roads; and commercial enterprises, except as necessary for realizing the purposes of scenic areas. (Sec. 309) The bill establishes the Condor National Scenic Trail which shall extend approximately 400 miles from Lake Piru in the southern portion of the Los Padres National Forest to the Bottchers Gap Campground in the northern portion of the forest. The bill allows the use of motorized vehicles on roads or trails included in the scenic trail on which such vehicles are already permitted. The Forest Service must not acquire any land or interest in land outside the exterior boundary of any federally managed area for the scenic trail without the landowner's consent. The Forest Service may realign segments of the scenic trail as necessary to fulfill the scenic trail's purposes. The Forest Service shall conduct a study that addresses the feasibility of, and alternatives for, connecting the northern and southern portions of the Los Padres National Forest by establishing a trail across the applicable portions of the northern and southern Santa Lucia Mountains of the southern California Coastal Range; and considers realignment of the trail or construction of new trail segments to avoid existing trail segments that currently allow motorized vehicles. Upon completion of the study, if the Forest Service determines that additional or alternative trail segments are feasible for inclusion in the scenic trail, it shall include those segments. (Sec. 310) The Forest Service shall study the feasibility of opening a new trail, for vehicles measuring 50 inches or less, that connects Forest Service Highway 95 to the existing off-highway vehicle trail system in the Ballinger Canyon off-highway vehicle area. (Sec. 311) The Forest Service shall conduct a study for improving nonmotorized recreation trail opportunities (including mountain bicycling) on land not designated as wilderness within the Santa Barbara, Ojai, and Mt. Pinos ranger districts. (Sec. 312) The BLM or Forest Service shall ensure that Indian tribes have access to the wilderness areas, scenic areas, and potential wilderness areas designated by this title for traditional cultural and religious purposes. The agencies, on request by a tribe, may temporarily close one or more portions of such an area to protect the privacy of the tribe's members when conducting traditional cultural and religious activities. TITLE IV--SAN GABRIEL MOUNTAINS FOOTHILLS AND RIVERS PROTECTION San Gabriel Mountains Foothills and Rivers Protection Act Subtitle A--San Gabriel National Recreation Area (Sec. 413) The bill establishes the San Gabriel National Recreation Area in California as a unit of the National Park System. Public lands included in the recreation area shall be administered by the National Park Service (NPS). (Sec. 414) The NPS shall manage the public lands included in the recreation area to protect and enhance their natural resources and values. The NPS shall cooperate with the Department of Defense (DOD) in developing opportunities for the management of the federal land under DOD's jurisdiction included in the recreation area. The NPS is encouraged to work with owners of nonfederal land who have agreed to cooperate in advancing the purposes of this subtitle. Certain requirements concerning the nonoperation of solid waste disposal sites within any NPS units shall not apply to the Puente Hills landfill, materials recovery facility, or intermodal facility. The NPS and the San Gabriel National Recreation Area Public Advisory Council (established by this bill) shall establish a comprehensive management plan for the recreation area that supports its purposes. The NPS shall incorporate the visitor services plan required by this bill into such plan. In developing the management plan, the NPS shall consider recommendations of the San Gabriel National Recreation Area Partnership (established by this bill). The NPS shall include recommendations of the partnership in the management plan if they are feasible and consistent with the recreation area's purposes, this subtitle, and applicable laws. (Sec. 415) The NPS may acquire by exchange, donation, or purchase from a willing seller nonfederal land within the boundaries of the recreation area if the land contains important biological, cultural, historic, or recreational values. Any land or interest in land acquired by the United States within the boundaries of the recreation area shall be included in the recreation area. (Sec. 417) The advisory council shall advise the NPS on the development and implementation of the management plan and the visitor services plan. (Sec. 418) The partnership shall make recommendations to the NPS regarding the development and implementation of the management plan; review and comment on the visitor services plan and facilitate its implementation; assist units of local government, regional planning organizations, and nonprofit organizations in advancing the purpose of the recreation area, including by carrying out programs and projects that recognize, protect, and enhance resource values within the recreation area; make recommendations to the NPS regarding the appointment of members to the advisory council; and carry out any other actions necessary to achieve the purposes of this subtitle. The NPS shall convene the partnership on a regular basis. The NPS may provide to the partnership or any partnership member such technical and financial assistance determined appropriate to carry out this subtitle. To facilitate the administration of the recreation area, the NPS is authorized to construct administrative or visitor use facilities on land owned by a nonprofit organization, local agency, or other public entity. A facility may only be developed with the consent of the owner of the nonfederal land. The NPS must give priority to actions that conserve the significant resources of the recreation area; and provide educational, interpretive, and recreational opportunities consistent with the purposes of the recreation area. The partnership shall establish a Water Technical Advisory Committee to advise the NPS regarding water-related issues related to the recreation area, and a Public Safety Advisory Committee to advise the NPS regarding public safety issues related to the recreation area. (Sec. 419) The visitor services plan shall, among other things assess current and anticipated future visitation to the recreation area, including recreation destinations; and consider the demand for various types of recreation, including hiking, picnicking, and horseback riding. The NPS may construct visitor use facilities in the recreation area. The NPS may accept and use donated funds, property, in-kind contributions, and services to carry out this subtitle, but may not use such authority to accept nonfederal land that has been acquired after enactment of this bill through the use of eminent domain. Subtitle B--San Gabriel Mountains (Sec. 422) The bill modifies the San Gabriel Mountains National Monument to include approximately 109,167 acres of additional National Forest System land. The Forest Service shall update the existing San Gabriel Mountains National Monument Plan to provide management direction and protection for the lands added to the monument. (Sec. 423) The bill designates certain parcels of National Forest System land in California as wilderness and as components of the National Wilderness Preservation System. (Sec. 424) The Forest Service may take measures in a wilderness area or addition necessary to control fire, insects, or diseases. To ensure a timely and efficient response to a fire emergency in a wilderness area or addition, the Forest Service shall establish agency approval procedures for responding to fire emergencies, and enter into agreements with state or local firefighting agencies. The bill specifies requirements regarding the grazing of livestock that has already been established. The Forest Service may conduct any management activities that are necessary to maintain or restore fish or wildlife populations or habitats in the wilderness areas and wilderness additions if the activities are consistent with relevant wilderness management plans and conducted in accordance with appropriate policies, such as those established in a specified House report. Such a management activity may include the occasional and temporary use of motorized vehicles, if their use would promote healthy, viable, and more naturally distributed wildlife populations that would enhance wilderness values while causing the minimum impact necessary to accomplish those tasks. California may use aircraft, including helicopters, in a wilderness area or addition to survey, capture, transplant, monitor, or provide water for a wildlife population, including bighorn sheep. The wilderness areas and additions are withdrawn from entry, appropriation, and disposal under the public land laws; location, entry, and patent under the mining laws; and operation of the mineral materials and geothermal leasing laws. Any land located within the boundary of a wilderness area or addition that is acquired by the United States shall become part of the area or addition. The Forest Service may authorize the installation and maintenance of hydrologic, meteorologic, or climatological collection devices in a wilderness area or addition if the facilities and access to them is essential to a flood warning, flood control, or water reservoir operation activity. The Forest Service may authorize the Angeles Crest 100 competitive running event to continue as it was operated and permitted in 2015 within the additions to the Sheep Mountain Wilderness and the Pleasant View Ridge Wilderness Area, provided that the event is authorized and conducted in a manner compatible with the preservation of the areas as wilderness. (Sec. 425) The bill designates specified segments of rivers in California as components of the National Wild and Scenic Rivers System. The bill declares that any new reservation of water or new use of water pursuant to existing water rights held by the United States to advance the purposes of National Wild and Scenic Rivers Act shall be for nonconsumptive instream use only within those segments. (Sec. 426) The Forest Service must comply with the applicable procedural and substantive requirements of the law of California in order to obtain and hold any water rights not in existence with respect to the San Gabriel Mountains National Monument, the wilderness areas and wilderness additions, and the designated wild and scenic rivers. TITLE V--RIM OF THE VALLEY CORRIDOR PRESERVATION Rim of the Valley Corridor Preservation Act (Sec. 502) adjusts the boundary of the Santa Monica Mountains National Recreation Area in California to include the Rim of the Valley Unit. The Rim of the Valley Unit, and any lands or interests acquired by the United States and located within its boundaries, shall be administered as part of the recreation area. The National Park Service may acquire only through exchange, donation, or purchase from a willing seller any nonfederal land within the boundaries of the Rim of the Valley Unit. TITLE VI--WILD OLYMPICS WILDERNESS AND WILD AND SCENIC RIVERS Wild Olympics Wilderness and Wild and Scenic Rivers Act (Sec. 602) The bill designates specified federal lands in the Olympic National Forest in Washington, comprising approximately 126,554 acres, as wilderness and as components of the National Wilderness Preservation System. Approximately 5,346 acres of specified land is designated as potential wilderness. Once nonconforming uses in the potential wilderness have terminated, it shall be designated as wilderness and become part of the adjacent wilderness area. The Forest Service may take measures that are necessary to control fire, insects, and diseases in the wilderness areas. (Sec. 603) The bill designates specified river segments in Washington as components of the Wild and Scenic Rivers System. The Forest Service shall incorporate such designations into updated management plans for units of the National Forest System. (Sec. 604) The federal land within the boundaries of the segments is withdrawn from entry, appropriation, or disposal under the public land laws; location, entry, and patent under the mining laws; and disposition under all laws related to mineral and geothermal leasing or mineral materials. TITLE VII--STUDY ON FLOOD RISK MITIGATION (Sec. 701) The Government Accountability Office shall study the contributions of wilderness designations under this bill to protections that mitigate the risk of flooding in residential areas. TITLE VIII--MISCELLANEOUS (Sec. 801) Interior and USDA are encouraged to ensure service member and veteran access to public lands designated by this bill for purposes of outdoor recreation and to participate in outdoor-related volunteer and wellness programs.","pending_committee_id":2324,"committee":{"committee_id":2324,"chamber":"S","chamber_id":115,"name":"Energy And Natural Resources"},"referrals":[{"date":"2019-05-07","committee_id":2310,"chamber":"H","chamber_id":114,"name":"Natural Resources"},{"date":"2019-05-16","committee_id":3991,"chamber":"H","chamber_id":114,"name":"Subcommittee on National Parks, Forests, and Public Lands"},{"date":"2020-02-13","committee_id":2324,"chamber":"S","chamber_id":115,"name":"Energy And Natural Resources"}],"history":[{"date":"2019-05-07","action":"Introduced in House","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-05-07","action":"Referred to the House Committee on Natural Resources.","chamber":"H","chamber_id":114,"importance":1},{"date":"2019-05-16","action":"Referred to the Subcommittee on National Parks, Forests, and Public Lands.","chamber":"H","chamber_id":114,"importance":1},{"date":"2019-07-10","action":"Subcommittee Hearings Held.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-11-20","action":"Subcommittee on National Parks, Forests, and Public Lands Discharged.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-11-20","action":"Committee Consideration and Mark-up Session Held.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-11-20","action":"Ordered to be Reported (Amended) by the Yeas and Nays: 21 - 13.","chamber":"H","chamber_id":114,"importance":1},{"date":"2020-02-04","action":"Reported (Amended) by the Committee on Natural Resources. H. Rept. 116-387.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-04","action":"Placed on the Union Calendar, Calendar No. 310.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-10","action":"Rules Committee Resolution H. Res. 844 Reported to House. Rule provides for consideration of H.R. 2546 and H.J. Res. 79. The resolution provides for one hour of debate on each measure. The resolution provides for consideration of H.R. 2546 under a structured rule and consideration of H.J.Res. 79 under a closed rule with a motion to recommit with or without instructions for each measure.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"Considered under the provisions of rule H. Res. 844. (consideration: CR H1058-1104; text: CR H1066-1089)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"Rule provides for consideration of H.R. 2546 and H.J. Res. 79. The resolution provides for one hour of debate on each measure. The resolution provides for consideration of H.R. 2546 under a structured rule and consideration of H.J.Res. 79 under a closed rule with a motion to recommit with or without instructions for each measure.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 844 and Rule XVIII.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"The Speaker designated the Honorable James P. McGovern to act as Chairman of the Committee.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 2546.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.789 Amendment (A001) offered by Ms. DeGette. (consideration: CR H1089-1090, H1105; text: CR H1089)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H.Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the DeGette amendment No. 1.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the DeGette amendment, the Chair put the question on adoption of the amendment, and by voice vote announced that the ayes had prevailed. Mr. Tipton demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.790 Amendment (A002) offered by Mr. McClintock. (consideration: CR H1090-1091, H1105-1106; text: CR H1090)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H. Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the McClintock amendment No. 2.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the McClintock amendment, the Chair put the question on adoption of the amendment, and by voice vote announced that the noes had prevailed. Mr. McClintock demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.791 Amendment (A003) offered by Mr. McClintock. (consideration: CR H1091-1092, H1106-1107; text: CR H1091)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H. Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the McClintock amendment No. 3.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the McClintock amendment, the Chair put the question on adoption of the amendment, and by voice vote announced that the noes had prevailed. Mr. McClintock demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.792 Amendment (A004) offered by Mr. Brown (MD). (consideration: CR H1092-1093; text: CR H1092)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H. Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the Brown (MD) amendment No. 4.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.792 On agreeing to the Brown (MD) amendment (A004) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.793 Amendment (A005) offered by Mr. Panetta. (consideration: CR H1093-1094, H1107; text: CR H1093)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H. Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the Panetta amendment No. 5.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Panetta amendment, the Chair put the question on adoption of the amendment, and by voice vote announced that the ayes had prevailed. Mr. Panetta demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.794 Amendment (A006) offered by Mr. Westerman. (consideration: CR H1094-1095, H1107-1108; text: CR H1094)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H. Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the Westerman amendment No. 6.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Westerman amendment, the Chair put the question on adoption of the amendment, and by voice vote announced that the noes had prevailed. Mr. Westerman demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.795 Amendment (A007) offered by Mr. Westerman. (consideration: CR H1095-1096, H1108-1109; text: CR H1095)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H. Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the Westerman amendment No. 7.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Westerman amendment, the Chair put the question on adoption of the amendment, and by voice vote announced that the noes had prevailed. Mr. Westerman demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.796 Amendment (A008) offered by Mr. Cunningham. (consideration: CR H1096-1097, H1109; text: CR H1096)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H. Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the Cunningham amendment No. 8.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Cunningham amendment, the Chair put the question on adoption of the amendment, and by voice vote announced that the ayes had prevailed. Mr. Cunningham demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.797 Amendment (A009) offered by Mr. Tipton. (consideration: CR H1097-1101, H1109-1110; text: CR H1097)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H. Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the Tipton amendment No. 9.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Tipton amendment, the Chair put the question on adoption of the amendment, and by voice vote announced that the noes had prevailed. Mr. Tipton demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.798 Amendment (A010) offered by Mr. Tipton. (consideration: CR H1101-1102; text: CR H1102)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H. Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the Tipton amendment No. 10.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.798 On agreeing to the Tipton amendment (A010) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.799 Amendment (A011) offered by Mr. Kilmer. (consideration: CR H1102-1103; text: CR H1102-1103)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H. Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the Kilmer amendment No. 11.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.799 On agreeing to the Kilmer amendment (A011) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.800 Amendment (A012) offered by Ms. Schrier. (consideration: CR H1103-1104; text: CR H1104)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"DEBATE - Pursuant to the provisions of H. Res. 844, the Committee of the Whole proceeded with 10 minutes of debate on the Schrier amendment No. 12.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.800 On agreeing to the Schrier amendment (A012) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"Ms. DeGette moved that the committee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"On motion that the committee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 2546 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"Considered as unfinished business. (consideration: CR H1104-1112)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"UNFINISHED BUSINESS - The Chair announced that the unfinished business was on adoption of amendments, which had been debated earlier and on which further proceedings had been postponed.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.789 On agreeing to the DeGette amendment (A001) Agreed to by recorded vote: 229 - 189 (Roll no. 60).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.790 On agreeing to the McClintock amendment (A002) Failed by recorded vote: 181 - 239 (Roll no. 61).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.791 On agreeing to the McClintock amendment (A003) Failed by recorded vote: 182 - 236 (Roll no. 62).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.793 On agreeing to the Panetta amendment (A005) Agreed to by recorded vote: 406 - 12 (Roll no. 63).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.794 On agreeing to the Westerman amendment (A006) Failed by recorded vote: 193 - 228 (Roll no. 64).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.795 On agreeing to the Westerman amendment (A007) Failed by recorded vote: 188 - 233 (Roll no. 65).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.796 On agreeing to the Cunningham amendment (A008) Agreed to by recorded vote: 419 - 1 (Roll no. 66).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"H.Amdt.797 On agreeing to the Tipton amendment (A009) Failed by recorded vote: 183 - 234 (Roll no. 67).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 2546.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"The House adopted the amendment in the nature of a substitute as agreed to by the Committee of the Whole House on the state of the Union.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"Mr. McClintock moved to recommit with instructions to the Committee on Natural Resources. (text: CR H1110)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"Floor summary: DEBATE - The House proceeded with 10 minutes of debate on the McClintock motion to recommit with instructions. The instructions contained in the motion seek to require the bill to be reported back to the House with an amendment to allow mechanical wildfire mitigation in wilderness areas designated under the bill to protect life, property or the environment.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"The previous question on the motion to recommit with instructions was ordered without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"On motion to recommit with instructions Failed by the Yeas and Nays: 199 - 215 (Roll no. 68).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"On passage Passed by the Yeas and Nays: 231 - 183 (Roll no. 69).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-12","action":"Motion to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-02-13","action":"Received in the Senate and Read twice and referred to the Committee on Energy and Natural Resources.","chamber":"S","chamber_id":115,"importance":1}],"sponsors":[{"people_id":8967,"person_hash":"klyveg3n","party_id":"1","state_id":52,"party":"D","role_id":1,"role":"Rep","name":"Diana DeGette","first_name":"Diana","middle_name":"","last_name":"DeGette","suffix":"","nickname":"","district":"HD-CO-1","ftm_eid":6006202,"votesmart_id":561,"opensecrets_id":"N00006134","knowwho_pid":158770,"ballotpedia":"Diana_DeGette","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":20088,"person_hash":"3omk7yar","party_id":"1","state_id":52,"party":"D","role_id":1,"role":"Rep","name":"Joseph Neguse","first_name":"Joseph","middle_name":"","last_name":"Neguse","suffix":"","nickname":"","district":"HD-CO-2","ftm_eid":23406914,"votesmart_id":151075,"opensecrets_id":"N00041080","knowwho_pid":485964,"ballotpedia":"Joe_Neguse","sponsor_type_id":2,"sponsor_order":2,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"HR844","sast_bill_id":1335776},{"type_id":8,"type":"Related","sast_bill_number":"HB1708","sast_bill_id":1238930},{"type_id":8,"type":"Related","sast_bill_number":"HB2199","sast_bill_id":1251194},{"type_id":8,"type":"Related","sast_bill_number":"HB2215","sast_bill_id":1251210},{"type_id":8,"type":"Related","sast_bill_number":"HB2250","sast_bill_id":1251180},{"type_id":8,"type":"Related","sast_bill_number":"HB2642","sast_bill_id":1259961},{"type_id":8,"type":"Related","sast_bill_number":"HB5714","sast_bill_id":1324274},{"type_id":8,"type":"Related","sast_bill_number":"SB1109","sast_bill_id":1251289},{"type_id":8,"type":"Related","sast_bill_number":"SB1110","sast_bill_id":1251234},{"type_id":8,"type":"Related","sast_bill_number":"SB1111","sast_bill_id":1251247},{"type_id":8,"type":"Related","sast_bill_number":"SB1382","sast_bill_id":1260001},{"type_id":8,"type":"Related","sast_bill_number":"SB3288","sast_bill_id":1337576}],"subjects":[{"subject_id":13395,"subject_name":"Public lands and natural resources"},{"subject_id":13539,"subject_name":"Colorado"},{"subject_id":13380,"subject_name":"Land transfers"},{"subject_id":13394,"subject_name":"Water use and supply"},{"subject_id":13301,"subject_name":"Wilderness and natural areas, wildlife refuges, wild rivers, habitats"},{"subject_id":13127,"subject_name":"Advisory bodies"},{"subject_id":13131,"subject_name":"Air quality"},{"subject_id":13625,"subject_name":"Archaeology and anthropology"},{"subject_id":13135,"subject_name":"Aviation and airports"},{"subject_id":13391,"subject_name":"California"},{"subject_id":21500,"subject_name":"Climate change and greenhouse gases"},{"subject_id":13146,"subject_name":"Congressional oversight"},{"subject_id":13542,"subject_name":"Ecology"},{"subject_id":13173,"subject_name":"Electric power generation and transmission"},{"subject_id":13333,"subject_name":"Environmental assessment, monitoring, research"},{"subject_id":13188,"subject_name":"Fires"},{"subject_id":22687,"subject_name":"Forests, forestry, trees"},{"subject_id":22688,"subject_name":"Government studies and investigations"},{"subject_id":13547,"subject_name":"Historical and cultural resources"},{"subject_id":13379,"subject_name":"Indian lands and resources rights"},{"subject_id":13420,"subject_name":"Lakes and rivers"},{"subject_id":13425,"subject_name":"Land use and conservation"},{"subject_id":13803,"subject_name":"Military education and training"},{"subject_id":13244,"subject_name":"Military facilities and property"},{"subject_id":20766,"subject_name":"Military readiness"},{"subject_id":13410,"subject_name":"Monuments and memorials"},{"subject_id":13257,"subject_name":"Parks, recreation areas, trails"},{"subject_id":13727,"subject_name":"Product development and innovation"},{"subject_id":13474,"subject_name":"Public utilities and utility rates"},{"subject_id":13268,"subject_name":"Research and development"},{"subject_id":13578,"subject_name":"Washington State"},{"subject_id":13337,"subject_name":"Wildlife conservation and habitat protection"}],"texts":[{"doc_id":2018374,"date":"2019-05-14","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB2546\/id\/2018374","state_link":"https:\/\/www.congress.gov\/116\/bills\/hr2546\/BILLS-116hr2546ih.pdf","text_size":361672,"text_hash":"623d45304632901372d9767596735650"},{"doc_id":2122053,"date":"2020-02-05","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB2546\/id\/2122053","state_link":"https:\/\/www.congress.gov\/116\/bills\/hr2546\/BILLS-116hr2546rh.pdf","text_size":359642,"text_hash":"0fad20828a8324fc3b82b2ccc3f9f1f6"},{"doc_id":2135346,"date":"2020-02-14","type":"Engrossed","type_id":4,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB2546\/id\/2135346","state_link":"https:\/\/www.congress.gov\/116\/bills\/hr2546\/BILLS-116hr2546eh.pdf","text_size":543762,"text_hash":"269ba02c7ef5672d67286e94b5c8bdee"}],"votes":[{"roll_call_id":922238,"date":"2020-02-12","desc":"On agreeing to the Panetta amendment (A005) H.Amdt.793 RC# 63","yea":406,"nay":12,"nv":0,"absent":17,"total":435,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB2546\/id\/922238","state_link":"https:\/\/clerk.house.gov\/Votes\/202063"},{"roll_call_id":922239,"date":"2020-02-12","desc":"On agreeing to the McClintock amendment (A003) H.Amdt.791 RC# 62","yea":182,"nay":236,"nv":0,"absent":17,"total":435,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB2546\/id\/922239","state_link":"https:\/\/clerk.house.gov\/Votes\/202062"},{"roll_call_id":922240,"date":"2020-02-12","desc":"On agreeing to the McClintock amendment (A002) H.Amdt.790 RC# 61","yea":181,"nay":239,"nv":0,"absent":15,"total":435,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB2546\/id\/922240","state_link":"https:\/\/clerk.house.gov\/Votes\/202061"},{"roll_call_id":922241,"date":"2020-02-12","desc":"On agreeing to the DeGette amendment (A001) H.Amdt.789 RC# 60","yea":229,"nay":189,"nv":0,"absent":17,"total":435,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB2546\/id\/922241","state_link":"https:\/\/clerk.house.gov\/Votes\/202060"},{"roll_call_id":922242,"date":"2020-02-12","desc":"On agreeing to the Westerman amendment (A006) H.Amdt.794 RC# 64","yea":193,"nay":228,"nv":0,"absent":14,"total":435,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB2546\/id\/922242","state_link":"https:\/\/clerk.house.gov\/Votes\/202064"},{"roll_call_id":922243,"date":"2020-02-12","desc":"On agreeing to the Westerman amendment (A007) H.Amdt.795 RC# 65","yea":188,"nay":233,"nv":0,"absent":14,"total":435,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB2546\/id\/922243","state_link":"https:\/\/clerk.house.gov\/Votes\/202065"},{"roll_call_id":922244,"date":"2020-02-12","desc":"On motion to recommit with instructions RC# 68","yea":199,"nay":215,"nv":0,"absent":15,"total":429,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB2546\/id\/922244","state_link":"https:\/\/clerk.house.gov\/Votes\/202068"},{"roll_call_id":922245,"date":"2020-02-12","desc":"On agreeing to the Tipton amendment (A009) H.Amdt.797 RC# 67","yea":183,"nay":234,"nv":0,"absent":18,"total":435,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB2546\/id\/922245","state_link":"https:\/\/clerk.house.gov\/Votes\/202067"},{"roll_call_id":922246,"date":"2020-02-12","desc":"On agreeing to the Cunningham amendment (A008) H.Amdt.796 RC# 66","yea":419,"nay":1,"nv":0,"absent":15,"total":435,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB2546\/id\/922246","state_link":"https:\/\/clerk.house.gov\/Votes\/202066"},{"roll_call_id":922247,"date":"2020-02-12","desc":"On passage RC# 69","yea":231,"nay":183,"nv":0,"absent":15,"total":429,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB2546\/id\/922247","state_link":"https:\/\/clerk.house.gov\/Votes\/202069"}],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"type":"Hearing","date":"2019-07-10","time":"10:00","location":"1324 LHOB","description":"House Subcommittee on National Parks, Forests, and Public Lands Hearing"},{"type_id":1,"type":"Hearing","date":"2019-11-20","time":"10:00","location":"<\/span>","description":"House Committee on Natural Resources Hearing"},{"type_id":1,"type":"Hearing","date":"2020-02-10","time":"17:00","location":"H-313 CAPITOL","description":"House Committee on Rules Hearing"}]}}