{"bill":{"bill_id":1142048,"change_hash":"6ab3b2c774cc1f6ee4d7f581892ffeb2","session_id":1658,"session":{"session_id":1658,"state_id":52,"year_start":2019,"year_end":2020,"prefile":0,"sine_die":1,"prior":1,"special":0,"session_tag":"Regular Session","session_title":"2019-2020 Regular Session","session_name":"116th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/HB268\/2019","state_link":"https:\/\/www.congress.gov\/bill\/116th-congress\/house-bill\/268\/all-info","completed":0,"status":2,"status_date":"2019-01-17","progress":[{"date":"2019-01-08","event":1},{"date":"2019-01-08","event":9},{"date":"2019-01-08","event":9},{"date":"2019-01-17","event":2}],"state":"US","state_id":52,"bill_number":"HB268","bill_type":"B","bill_type_id":"1","body":"H","body_id":114,"current_body":"S","current_body_id":115,"title":"Supplemental Appropriations Act, 2019","description":"Provides FY2019 appropriations to federal agencies, including supplemental appropriations for disaster assistance and continuing appropriations for agencies that are included in the seven FY2019 appropriations bills that have not been enacted. The bill provides $14.2 billion in FY2019 supplemental appropriations for expenses related to the consequences of recent wildfires, hurricanes, volcanos, earthquakes, typhoons, and other natural disasters. The bill designates the spending as emergency spending, which is exempt from discretionary spending limits. The bill includes supplemental appropriations for the Department of Agriculture, the Department of Commerce, the Department of Justice, the Department of Defense, the U.S. Army Corps of Engineers, the Department of the Interior, the Department of Energy, the U.S. Coast Guard, the Environmental Protection Agency, the Forest Service, the Department of Health and Human Services, the Department of Labor, the Department of Education, the Government Accountability Office, the Department of Veterans Affairs, the Department of Transportation, and the Department of Housing and Urban Development. The bill also provides continuing FY2019 appropriations to several federal agencies through the earlier of February 8, 2019, or the enactment of the applicable appropriations legislation. This is known as a continuing resolution (CR) and ends the partial government shutdown that began after the existing CR expired on December 21, 2018, because seven of the remaining FY2019 appropriations bills have not been enacted. (Five of the FY2019 appropriations bills were enacted last year, including the Department of Defense Appropriations Act, 2019; the Energy and Water Development and Related Agencies Appropriations Act, 2019; the Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2019; the Legislative Branch Appropriations Act, 2019; and the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2019.) Additionally, the CR has the effect of extending through February 8, 2019, several authorities and programs that were extended in prior CRs, including the Violence Against Women Act, the authority for the Environmental Protection Agency to collect and spend certain fees related to pesticides, the Temporary Assistance for Needy Families (TANF) program, and several authorities related to immigration.","pending_committee_id":0,"committee":[],"referrals":[{"date":"2019-01-08","committee_id":2298,"chamber":"H","chamber_id":114,"name":"Appropriations"}],"history":[{"date":"2019-01-08","action":"Introduced in House","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-08","action":"Referred to the Committee on Appropriations, and in addition to the Committee on the Budget, for a period to be subsequently determined by the Speaker, in each case for consideration of such provisions as fall within the jurisdiction of the committee concerned.","chamber":"H","chamber_id":114,"importance":1},{"date":"2019-01-08","action":"Referred to the Committee on Appropriations, and in addition to the Committee on the Budget, for a period to be subsequently determined by the Speaker, in each case for consideration of such provisions as fall within the jurisdiction of the committee concerned.","chamber":"H","chamber_id":114,"importance":1},{"date":"2019-01-15","action":"Rules Committee Resolution H. Res. 43 Reported to House. Rule provides for consideration of H.R. 268 with 1 hour of general debate. The resolution waives all points of order against consideration of the bill. The resolution waives clause 6(a) of rule XIII with respect to resolutions reported from the Rules Committee through the legislative day of January 23, 2019, making or continuing appropriations for the fiscal year ending September 30, 2019.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"Rule H. Res. 43 passed House.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"Considered under the provisions of rule H. Res. 43. (consideration: CR H626-662; text: CR H639-646)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"Rule provides for consideration of H.R. 268 with 1 hour of general debate. The resolution waives all points of order against consideration of the bill. The resolution waives clause 6(a) of rule XIII with respect to resolutions reported from the Rules Committee through the legislative day of January 23, 2019, making or continuing appropriations for the fiscal year ending September 30, 2019.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 43 and Rule XVIII.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"The Speaker designated the Honorable Eleanor Holmes Norton to act as Chairwoman of the Committee.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 268.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.2 Amendment (A001) offered by Mr. Bishop (GA). (consideration: CR H646-647; text: CR H646)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Bishop (GA) amendment No. 1.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.2 On agreeing to the Bishop (GA) amendment (A001) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.3 Amendment (A002) offered by Mr. McGovern. (consideration: CR H647-649, H659; text: CR H647)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the McGovern amendment No. 2.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the McGovern amendment, the Chair put the question on the amendment and by voice vote, announced that the ayes had prevailed. Ms. Granger demanded a recorded vote and the Chair postponed further proceedings on the McGovern amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.4 Amendment (A003) offered by Mr. Rice (SC). (consideration: CR H649-650; text: CR H649)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Rice (SC) amendment No. 3.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.4 On agreeing to the Rice (SC) amendment (A003) Failed by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.5 Amendment (A004) offered by Ms. Velazquez. (consideration: CR H650; text: CR H650)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Velazquez amendment No. 4.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.5 On agreeing to the Velazquez amendment (A004) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.6 Amendment (A005) offered by Ms. Velazquez. (consideration: CR H650-651; text: CR H650)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Velazquez amendment No. 5.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.6 On agreeing to the Velazquez amendment (A005) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.7 Amendment (A006) offered by Mr. Stewart. (consideration: CR H651, H659; text: CR H651)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Stewart amendment No. 6.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Stewart amendment, the Chair put the question on the amendment and by voice vote, announced that the ayes had prevailed. Mr. Stewart demanded a recorded vote and the Chair postponed further proceedings on the Stewart amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.8 Amendment (A007) offered by Mr. Thompson (CA). (consideration: CR H651-652, text: CR H651)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Thompson (CA) amendment No. 7.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.8 On agreeing to the Thompson (CA) amendment (A007) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.9 Amendment (A008) offered by Mr. Thompson (CA). (consideration: CR H652; text: CR H652)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Thompson (CA) amendment No. 8.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.9 On agreeing to the Thompson (CA) amendment (A008) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.10 Amendment (A009) offered by Mr. Graves (LA). (consideration: CR H652-653; text: CR H652)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Graves (LA) amendment No. 9.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.10 On agreeing to the Graves (LA) amendment (A009) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.11 Amendment (A010) offered by Mr. Richmond. (consideration: CR H653-654; text: CR H653)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Richmond amendment No. 10.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.11 On agreeing to the Richmond amendment (A010) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.12 Amendment (A011) offered by Mr. Westerman. (consideration: CR H654-655; text: CR H654)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Westerman amendment No. 11.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.12 On agreeing to the Westerman amendment (A011) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.13 Amendment (A012) offered by Ms. Jayapal. (consideration: CR H655-656; text: CR H655)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Jayapal amendment No. 12.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.13 On agreeing to the Jayapal amendment (A012) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.14 Amendment (A013) offered by Mr. Sablan. (consideration: CR H656-658; text: CR H656)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Sablan amendment No. 13.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.14 On agreeing to the Sablan amendment (A013) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.15 Amendment (A014) offered by Mr. Sablan. (consideration: CR H658; text: CR H658)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Sablan amendment No. 14.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.15 On agreeing to the Sablan amendment (A014) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.16 Amendment (A015) offered by Miss Gonzalez-Colon (PR). (consideration: CR H658-659; text: CR H658)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - Pursuant to the provisions of H. Res. 43, the Committee of the Whole proceeded with 10 minutes of debate on the Gonzalez-Colon amendment No. 15.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.16 On agreeing to the Gonzalez-Colon (PR) amendment (A015) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"VACATED PROCEEDINGS - Mr. Stewart asked unanimous consent to vacate the proceedings on Stewart amendment No. 6 in Part B of House Report 116-2, which was postponed, to the end that the Chair put the question de novo. Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.7 On agreeing to the Stewart amendment (A006) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"H.Amdt.3 On agreeing to the McGovern amendment (A002) Agreed to by recorded vote: 230 - 197 (Roll no. 37).","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 268.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"Mr. Dunn moved to recommit with instructions to the Committee on Appropriations. (text: CR H660)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"DEBATE - The House proceeded with 10 minutes of debate on the Dunn motion to recommit with instructions. The instructions contained in the motion seek to require the bill to be reported back to the House with an amendment to strike title XII - Further Continuing Appropriations from the bill.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"The previous question on the motion to recommit with instructions was ordered without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"On motion to recommit with instructions Failed by recorded vote: 193 - 231 (Roll no. 38).","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"On passage Passed by the Yeas and Nays: 237 - 187 (Roll no. 39).","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-16","action":"Motion to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-17","action":"Received in the Senate.","chamber":"S","chamber_id":115,"importance":1},{"date":"2019-01-19","action":"Read the first time. Placed on Senate Legislative Calendar under Read the First Time.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-22","action":"Read the second time. Placed on Senate Legislative Calendar under General Orders. Calendar No. 15.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-22","action":"Motion to proceed to consideration of measure made in Senate. (CR S325)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-22","action":"Motion to proceed to consideration of measure agreed to in Senate by Voice Vote.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-22","action":"Measure laid before Senate by motion. (consideration: CR S325)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-22","action":"S.Amdt.5 Amendment SA 5 proposed by Senator McConnell for Senator Shelby. (consideration: CR S325) Of a perfecting nature.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-22","action":"S.Amdt.6 Amendment SA 6 proposed by Senator Schumer. (consideration: CR S325) Of a perfecting nature.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-24","action":"S.Amdt.5 Considered by Senate. (consideration: CR S549)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-24","action":"S.Amdt.6 Considered by Senate. (consideration: CR S549)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-24","action":"Considered by Senate. (consideration: CR S549, S557-583)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-24","action":"S.Amdt.5 Cloture motion on amendment SA 5 presented in Senate. (CR S557)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-24","action":"S.Amdt.6 Cloture motion on amendment SA 6 presented in Senate. (CR S558)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-24","action":"S.Amdt.5 Cloture on amendment SA 5 not invoked in Senate by Yea-Nay Vote. 50 - 47. Record Vote Number: 9. (CR S557)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-24","action":"S.Amdt.6 Cloture on amendment SA 6 not invoked in Senate by Yea-Nay Vote. 52 - 44. Record Vote Number: 10. (CR S558)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-14","action":"Motion to proceed to consideration of measure made in Senate. (CR S1882)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-14","action":"Cloture motion on the motion to proceed to the measure presented in Senate.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-26","action":"Cloture on the motion to proceed to the measure invoked in Senate by Yea-Nay Vote. 90 - 10. Record Vote Number: 53. (CR S1972)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-26","action":"Motion to proceed to measure considered in Senate. (CR S1972)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-27","action":"Motion to proceed to measure considered in Senate. (CR S2011)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"Motion to proceed to measure considered in Senate. (CR S2064)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"Motion to proceed to consideration of measure agreed to in Senate by Voice Vote.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"Measure laid before Senate by motion. (consideration: CR S2064-2066, S2070-2071, S2081)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"S.Amdt.5 Considered by Senate. (consideration: CR S2064)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"S.Amdt.6 Considered by Senate. (consideration: CR S2064)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"S.Amdt.5 Proposed amendment SA 5 withdrawn in Senate. (consideration: CR S2064)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"S.Amdt.6 Proposed amendment SA 6 withdrawn in Senate. (consideration: CR S2064)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"S.Amdt.201 Amendment SA 201 proposed by Senator Shelby. (consideration: CR S2064) In the nature of a substitute.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"S.Amdt.201 Cloture motion on amendment SA 201 presented in Senate. (CR S2064)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"S.Amdt.213 Amendment SA 213 proposed by Senator McConnell to Amendment SA 201. (consideration: CR S2065) To change the enactment date.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"S.Amdt.214 Amendment SA 214 proposed by Senator McConnell to Amendment SA 213. (consideration: CR S2065) Of a perfecting nature.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"S.Amdt.215 Amendment SA 215 proposed by Senator McConnell to language proposed to be stricken by amendment no. 201. (consideration: CR S2065) To change the enactment date.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"S.Amdt.216 Amendment SA 216 proposed by Senator McConnell to Amendment SA 215. (consideration: CR S2065) Of a perfecting nature.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-03-28","action":"Cloture motion on the measure presented in Senate. (CR S2081)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-04-01","action":"S.Amdt.201 Considered by Senate. (consideration: CR S2105-2114)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-04-01","action":"S.Amdt.213 Considered by Senate. (consideration: CR S2105-2114)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-04-01","action":"S.Amdt.214 Considered by Senate. (consideration: CR S2105-2114)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-04-01","action":"S.Amdt.215 Considered by Senate. (consideration: CR S2105-2114)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-04-01","action":"S.Amdt.216 Considered by Senate. (consideration: CR S2105-2114)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-04-01","action":"Considered by Senate. (consideration: CR S2105-2114)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-04-01","action":"S.Amdt.201 Cloture on amendment SA 201 not invoked in Senate by Yea-Nay Vote. 44 - 49. Record Vote Number: 55. (CR S2113)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-04-01","action":"S.Amdt.201 Motion by Senator McConnell to reconsider the vote by which cloture was not invoked on amendment SA 201 (Record Vote No. 55) entered in Senate.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-04-01","action":"Cloture not invoked in Senate by Yea-Nay Vote. 46 - 48. Record Vote Number: 56. (CR S2113)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-04-01","action":"Motion by Senator McConnell to reconsider the vote by which cloture on H.R. 268 was not invoked (Record Vote No. 56) entered in Senate.","chamber":"S","chamber_id":115,"importance":0}],"sponsors":[{"people_id":9084,"person_hash":"uhhvf8k8","party_id":"1","state_id":52,"party":"D","role_id":1,"role":"Rep","name":"Nita Lowey","first_name":"Nita","middle_name":"M.","last_name":"Lowey","suffix":"","nickname":"","district":"HD-NY-17","ftm_eid":4674617,"votesmart_id":26982,"opensecrets_id":"N00001024","knowwho_pid":158987,"ballotpedia":"Nita_Lowey","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"HR43","sast_bill_id":1153821},{"type_id":8,"type":"Related","sast_bill_number":"HJR45","sast_bill_id":1203276},{"type_id":8,"type":"Related","sast_bill_number":"SB572","sast_bill_id":1221981},{"type_id":8,"type":"Related","sast_bill_number":"HB2157","sast_bill_id":1250674},{"type_id":8,"type":"Related","sast_bill_number":"SB811","sast_bill_id":1239656},{"type_id":2,"type":"Similar To","sast_bill_number":"HR357","sast_bill_id":1257334}],"subjects":[{"subject_id":13437,"subject_name":"Emergency management"},{"subject_id":13510,"subject_name":"Accounting and auditing"},{"subject_id":13817,"subject_name":"Agricultural marketing and promotion"},{"subject_id":13818,"subject_name":"Agricultural prices, subsidies, credit"},{"subject_id":13130,"subject_name":"Agricultural research"},{"subject_id":13134,"subject_name":"Appropriations"},{"subject_id":13822,"subject_name":"Army Corps of Engineers"},{"subject_id":13332,"subject_name":"Atmospheric science and weather"},{"subject_id":13135,"subject_name":"Aviation and airports"},{"subject_id":13376,"subject_name":"Child safety and welfare"},{"subject_id":13813,"subject_name":"Coast guard"},{"subject_id":13145,"subject_name":"Congressional agencies"},{"subject_id":13146,"subject_name":"Congressional oversight"},{"subject_id":13433,"subject_name":"Correctional facilities and imprisonment"},{"subject_id":13150,"subject_name":"Defense spending"},{"subject_id":13151,"subject_name":"Department of Agriculture"},{"subject_id":13152,"subject_name":"Department of Commerce"},{"subject_id":13153,"subject_name":"Department of Defense"},{"subject_id":13154,"subject_name":"Department of Education"},{"subject_id":13155,"subject_name":"Department of Energy"},{"subject_id":13156,"subject_name":"Department of Health and Human Services"},{"subject_id":13157,"subject_name":"Department of Homeland Security"},{"subject_id":13158,"subject_name":"Department of Housing and Urban Development"},{"subject_id":13159,"subject_name":"Department of Justice"},{"subject_id":13160,"subject_name":"Department of Labor"},{"subject_id":13162,"subject_name":"Department of Transportation"},{"subject_id":13163,"subject_name":"Department of Veterans Affairs"},{"subject_id":13164,"subject_name":"Department of the Interior"},{"subject_id":13439,"subject_name":"Disaster relief and insurance"},{"subject_id":13168,"subject_name":"Economic development"},{"subject_id":13171,"subject_name":"Education programs funding"},{"subject_id":13173,"subject_name":"Electric power generation and transmission"},{"subject_id":13174,"subject_name":"Elementary and secondary education"},{"subject_id":13176,"subject_name":"Employment and training programs"},{"subject_id":13182,"subject_name":"Environmental Protection Agency (EPA)"},{"subject_id":13740,"subject_name":"Environmental health"},{"subject_id":13184,"subject_name":"Executive agency funding and structure"},{"subject_id":20754,"subject_name":"Family services"},{"subject_id":13188,"subject_name":"Fires"},{"subject_id":13189,"subject_name":"Floods and storm protection"},{"subject_id":22687,"subject_name":"Forests, forestry, trees"},{"subject_id":13195,"subject_name":"Government Accountability Office (GAO)"},{"subject_id":22688,"subject_name":"Government studies and investigations"},{"subject_id":13203,"subject_name":"Government trust funds"},{"subject_id":13209,"subject_name":"Health facilities and institutions"},{"subject_id":13212,"subject_name":"Health programs administration and funding"},{"subject_id":13516,"subject_name":"Historic sites and heritage areas"},{"subject_id":13219,"subject_name":"Housing and community development funding"},{"subject_id":13236,"subject_name":"Law enforcement administration and funding"},{"subject_id":13469,"subject_name":"Law enforcement officers"},{"subject_id":13342,"subject_name":"Lawyers and legal services"},{"subject_id":13846,"subject_name":"Legal Services Corporation"},{"subject_id":13335,"subject_name":"Marine and coastal resources, fisheries"},{"subject_id":13241,"subject_name":"Medical research"},{"subject_id":13314,"subject_name":"Mental health"},{"subject_id":13244,"subject_name":"Military facilities and property"},{"subject_id":13246,"subject_name":"Mississippi River"},{"subject_id":13251,"subject_name":"National Guard and reserves"},{"subject_id":13252,"subject_name":"National Institutes of Health (NIH)"},{"subject_id":13442,"subject_name":"Natural disasters"},{"subject_id":13256,"subject_name":"Oil and gas"},{"subject_id":13257,"subject_name":"Parks, recreation areas, trails"},{"subject_id":13260,"subject_name":"Public contracts and procurement"},{"subject_id":13262,"subject_name":"Public transit"},{"subject_id":13267,"subject_name":"Research administration and funding"},{"subject_id":13271,"subject_name":"Roads and highways"},{"subject_id":13272,"subject_name":"Rural conditions and development"},{"subject_id":13281,"subject_name":"Solid waste and recycling"},{"subject_id":13291,"subject_name":"Transportation programs funding"},{"subject_id":13491,"subject_name":"U.S. territories and protectorates"},{"subject_id":13575,"subject_name":"Utah"},{"subject_id":13295,"subject_name":"Veterans' medical care"},{"subject_id":13298,"subject_name":"Water quality"},{"subject_id":13299,"subject_name":"Water resources funding"},{"subject_id":13394,"subject_name":"Water use and supply"},{"subject_id":13300,"subject_name":"Watersheds"}],"texts":[{"doc_id":1841064,"date":"2019-01-09","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB268\/id\/1841064","state_link":"https:\/\/www.congress.gov\/116\/bills\/hr268\/BILLS-116hr268ih.pdf","text_size":350876,"text_hash":"96a78dea95016adccba596871cb169cb"},{"doc_id":1859477,"date":"2019-01-18","type":"Engrossed","type_id":4,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB268\/id\/1859477","state_link":"https:\/\/www.congress.gov\/116\/bills\/hr268\/BILLS-116hr268eh.pdf","text_size":218387,"text_hash":"51e643206a3760cc36c990a4e0539640"},{"doc_id":1867934,"date":"2019-01-23","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB268\/id\/1867934","state_link":"https:\/\/www.congress.gov\/116\/bills\/hr268\/BILLS-116hr268pcs.pdf","text_size":316084,"text_hash":"28c55932fded630f22191caf78bc48f0"}],"votes":[{"roll_call_id":783008,"date":"2019-01-16","desc":"On motion to recommit with instructions RC# 38","yea":193,"nay":231,"nv":9,"absent":0,"total":433,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB268\/id\/783008","state_link":"https:\/\/clerk.house.gov\/Votes\/201938"},{"roll_call_id":783009,"date":"2019-01-16","desc":"On passage RC# 39","yea":237,"nay":187,"nv":9,"absent":0,"total":433,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB268\/id\/783009","state_link":"https:\/\/clerk.house.gov\/Votes\/201939"},{"roll_call_id":783062,"date":"2019-01-16","desc":"On agreeing to the McGovern amendment (A002) H.Amdt.3 RC# 37","yea":230,"nay":197,"nv":12,"absent":0,"total":439,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB268\/id\/783062","state_link":"https:\/\/clerk.house.gov\/Votes\/201937"},{"roll_call_id":786005,"date":"2019-01-24","desc":"Cloture on amendment SA 5 S.Amdt.5 RC# 9","yea":50,"nay":47,"nv":3,"absent":0,"total":100,"passed":0,"chamber":"S","chamber_id":115,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB268\/id\/786005","state_link":"https:\/\/www.senate.gov\/legislative\/LIS\/roll_call_votes\/vote1161\/vote_116_1_00009.xml"},{"roll_call_id":786006,"date":"2019-01-24","desc":"Cloture on amendment SA 6 S.Amdt.6 RC# 10","yea":52,"nay":44,"nv":4,"absent":0,"total":100,"passed":0,"chamber":"S","chamber_id":115,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB268\/id\/786006","state_link":"https:\/\/www.senate.gov\/legislative\/LIS\/roll_call_votes\/vote1161\/vote_116_1_00010.xml"},{"roll_call_id":829326,"date":"2019-03-26","desc":"Cloture on the motion to proceed to the measure RC# 53","yea":90,"nay":10,"nv":0,"absent":0,"total":100,"passed":1,"chamber":"S","chamber_id":115,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB268\/id\/829326","state_link":"https:\/\/www.senate.gov\/legislative\/LIS\/roll_call_votes\/vote1161\/vote_116_1_00053.xml"},{"roll_call_id":833161,"date":"2019-04-01","desc":"Cloture RC# 56","yea":46,"nay":48,"nv":6,"absent":0,"total":100,"passed":0,"chamber":"S","chamber_id":115,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB268\/id\/833161","state_link":"https:\/\/www.senate.gov\/legislative\/LIS\/roll_call_votes\/vote1161\/vote_116_1_00056.xml"},{"roll_call_id":833162,"date":"2019-04-01","desc":"Motion by Senator McConnell to reconsider the vote by which cloture on H.R. 268 was not invoked (Record Vote No. 56) entered in Senate. RC# 56","yea":46,"nay":48,"nv":6,"absent":0,"total":100,"passed":0,"chamber":"S","chamber_id":115,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB268\/id\/833162","state_link":"https:\/\/www.senate.gov\/legislative\/LIS\/roll_call_votes\/vote1161\/vote_116_1_00056.xml"},{"roll_call_id":833163,"date":"2019-04-01","desc":"Motion by Senator McConnell to reconsider the vote by which cloture was not invoked on amendment SA 201 (Record Vote No. 55) entered in Senate. S.Amdt.201 RC# 55","yea":44,"nay":49,"nv":7,"absent":0,"total":100,"passed":0,"chamber":"S","chamber_id":115,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB268\/id\/833163","state_link":"https:\/\/www.senate.gov\/legislative\/LIS\/roll_call_votes\/vote1161\/vote_116_1_00055.xml"},{"roll_call_id":833164,"date":"2019-04-01","desc":"Cloture on amendment SA 201 S.Amdt.201 RC# 55","yea":44,"nay":49,"nv":7,"absent":0,"total":100,"passed":0,"chamber":"S","chamber_id":115,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB268\/id\/833164","state_link":"https:\/\/www.senate.gov\/legislative\/LIS\/roll_call_votes\/vote1161\/vote_116_1_00055.xml"}],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"type":"Hearing","date":"2019-01-15","time":"15:00","location":"H-313 CAPITOL","description":"House Committee on Rules Hearing"}]}}