{"bill":{"bill_id":1270911,"change_hash":"d8fc4e16846dea84f277d1b86a42aeea","session_id":1658,"session":{"session_id":1658,"state_id":52,"year_start":2019,"year_end":2020,"prefile":0,"sine_die":1,"prior":1,"special":0,"session_tag":"Regular Session","session_title":"2019-2020 Regular Session","session_name":"116th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/HB3621\/2019","state_link":"https:\/\/www.congress.gov\/bill\/116th-congress\/house-bill\/3621\/all-info","completed":0,"status":2,"status_date":"2020-01-30","progress":[{"date":"2019-07-05","event":1},{"date":"2019-07-05","event":9},{"date":"2019-07-16","event":10},{"date":"2020-01-30","event":2}],"state":"US","state_id":52,"bill_number":"HB3621","bill_type":"B","bill_type_id":"1","body":"H","body_id":114,"current_body":"S","current_body_id":115,"title":"Comprehensive CREDIT Act of 2020 Comprehensive Credit Reporting Enhancement, Disclosure, Innovation, and Transparency Act of 2020","description":"Provides for additional consumer credit protections, sets forth requirements for credit reporting agencies, and prohibits the inclusion of specified information on credit reports. TITLE I—IMPROVEMENTS TO THE DISPUTE PROCESS The dispute process for consumers challenging information contained on their credit report is revised for challenges (1) through the credit reporting agency, and (2) through the furnisher of credit information. Credit reporting agencies must disclose to consumers how to dispute this information. If a credit report is revised as a result of a dispute, the credit reporting agency must provide the consumer a free copy of the revised report and credit score. Furnishers of credit information must maintain all records to substantiate the credit information provides to credit reporting agencies. Consumers must be notified when a furnisher provides specific negative credit information within five business days of it being reported to a credit reporting agency. The bill also establishes an appeals process for disputed credit information and sets forth procedures for the credit reporting agencies and furnishers of this information. Credit reporting agencies must identify disputed information on a credit report and ensure accuracy and completeness in credit reports. The bill also establishes the right for courts to award injunctive relief to require compliance with consumer credit laws. TITLE II—FREE CREDIT SCORES FOR CONSUMERS The bill requires credit reporting agencies to provide free credit scores to consumers along with their free annual credit reports. The bill also provides for additional free credit scores and credit reports when a consumer is disputing information contained on their credit report or has had previously removed information reinserted into their report, and automatic free credit scores and credit reports to consumers who have obtained a fraud alert or security freeze. Credit reporting agencies must provide consumers with additional information regarding the calculation of their credit score, including factors that adversely effected the score, and specific actions a consumer may take to improve the score. The bill establishes educational credit scores to be used by a consumer in understanding how a lender or creditor may use the information contained in a consumer's credit report if a current credit score is not available. Private education lenders, motor vehicle lenders, indirect auto lenders, and residential mortgage lenders must give consumers free copies of consumer reports or credit scores used for making underwriting decisions before consumers sign the respective loan agreements. TITLE III—STUDENT BORROWER CREDIT IMPROVEMENT ACT The bill prohibits a credit reporting agency from furnishing a credit report containing any adverse item of information relating to a delinquent or defaulted private education loan of a borrower who has a specified demonstrated history of loan repayment. TITLE IV—CREDIT RESTORATION FOR VICTIMS OF PREDATORY ACTIVITIES AND UNFAIR CONSUMER REPORTING PRACTICES The bill revises the information included on a credit report by requiring removal of adverse information that resulted from fraudulent lending activity regarding private education loans and residential mortgage loans, expediting the removal of debt that is no longer owed, prohibiting the inclusion of an arrest that did not result in conviction, in general reducing the time period adverse information stays on a credit report from seven years to four years, and limiting the inclusion of certain medical debt. TITLE V—CLARITY IN CREDIT SCORE FORMATION The Consumer Financial Protection Bureau (CFPB) must regulate credit score models by establishing standards for validating the accuracy and predictive value of these models. The bill also gives the CFPB the authority to prohibit the use of certain factors in credit score models. The CFPB must report on the impact of the inclusion of nontraditional data in these models. TITLE VI—RESTRICTIONS ON CREDIT CHECKS FOR EMPLOYMENT DECISIONS A credit reporting agency is prohibited from providing a consumer's credit information for employment purposes, unless the information is for a national security investigation, for a background check or investigation required by regulation, or otherwise required by law. TITLE VII—PROHIBITION ON MISLEADING AND UNFAIR CONSUMER REPORTING PRACTICES The bill prohibits automatic renewals for promotional consumer credit products and services, allows the CFPB to set maximum fees for products and services offered by credit reporting agencies, and allows for multiple credit inquiries of the same type without penalty to a consumer's credit score. Additionally, the bill directs the CFPB to issue rules to provide for access to consumer reporting information for nonnative English speakers, the visually impaired, and the hearing impaired; and the registration of credit reporting agencies. The bill also establishes credit protections for consumers affected by a government shutdown. TITLE VIII—PROTECTIONS AGAINST IDENTITY THEFT, FRAUD, OR A RELATED CRIME The bill revises fraud alert protections to allow for an extension of these protections upon request of the consumer if the threat of fraud is ongoing. The bill also requires a credit reporting agency to provide free credit monitoring and identity theft protection services to victims of fraud, the unemployed, recipients of public assistance, active duty uniformed consumer, and those 65 years of age and older. The bill expands to victims of fraud existing consumer protections applicable to victims of identity theft, including free credit scores, additional free credit reports, and access to records of fraudulent activity. The CFPB must develop procedures for reporting fraud and other related crime. TITLE IX—MISCELLANEOUS Contract provisions that violate specified consumer protections or that are against the public interest are null and void. The Government Accountability Office (GAO) must study (1) the use of credit reports and credit scores in housing determinations, (2) the effects on future lending of credit scores impacted by defaulted or delinquent private student loans, and (3) credit reporting agency compliance with consent orders. The bill revises consumer credit protections for servicemembers. The bill (1) extends consumer credit protections to certain active duty uniformed consumers in a combat zone or aboard a U.S. vessel, (2) prohibits the inclusion on a credit report of adverse credit information that occurred while a uniformed consumer was engaged in that type of active duty, and (3) provides for negative credit information alerts to such consumers. The bill also adds to those groups covered by specified active duty credit protections individuals in the commissioned corps of the National Oceanic and Atmospheric Administration and the Public Health Service. The bill allows for the reporting of certain positive consumer credit information to credit reporting agencies. Specifically, a person may report information related to a consumer's performance in making payments either under a lease agreement for a dwelling or pursuant to a contract for a utility or telecommunications service. The GAO must report on the consumer impact of such reporting. Nationwide credit reporting agencies are subject to supervision and examination by the CFPB with respect to cybersecurity.","pending_committee_id":0,"committee":[],"referrals":[{"date":"2019-07-05","committee_id":2304,"chamber":"H","chamber_id":114,"name":"Financial Services"}],"history":[{"date":"2019-07-05","action":"Introduced in House","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-07-05","action":"Referred to the House Committee on Financial Services.","chamber":"H","chamber_id":114,"importance":1},{"date":"2019-07-16","action":"Committee Consideration and Mark-up Session Held.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-07-16","action":"Ordered to be Reported (Amended) by the Yeas and Nays: 33 - 25.","chamber":"H","chamber_id":114,"importance":1},{"date":"2019-12-09","action":"Reported (Amended) by the Committee on Financial Services. H. Rept. 116-331.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-12-09","action":"Placed on the Union Calendar, Calendar No. 266.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-27","action":"Rules Committee Resolution H. Res. 811 Reported to House. Rule provides for consideration of H.R. 3621. The resolution makes in order a motion that the House concur in the Senate amendment with amendments to H.R. 550. The resolution provides for H.R. 3621 under a structured rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-28","action":"Rule H. Res. 811 passed House.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"Considered under the provisions of rule H. Res. 811. (consideration: CR H653-697; text: CR H661-681)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"Rule provides for consideration of H.R. 3621. The resolution makes in order a motion that the House concur in the Senate amendment with amendments to H.R. 550. The resolution provides for H.R. 3621 under a structured rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 811 and Rule XVIII.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"The Speaker designated the Honorable Gregorio Kilili Camacho Sablan to act as Chairman of the Committee.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 3621.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.753 Amendment (A001) offered by Mr. DeSaulnier. (consideration: CR H681; text: CR H681)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H.Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the DeSaulnier amendment No. 1.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.753 On agreeing to the DeSaulnier amendment (A001) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.754 Amendment (A002) offered by Ms. Shalala. (consideration: CR H682; text: CR H682)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H.Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Shalala amendment No. 2.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.754 On agreeing to the Shalala amendment (A002) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.755 Amendment (A003) offered by Mr. Timmons. (consideration: CR H682-683; text: CR H682-683)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H.Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Timmons amendment No. 3.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.755 On agreeing to the Timmons amendment (A003) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.756 Amendment (A004) offered by Mr. Clay. (consideration: CR H683-685, H697-698; text: CR H683-684)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H.Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Clay amendment No. 4.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Clay amendment, the Chair put the question on adoption of the amendment, and by voice vote announced that the ayes had prevailed. Mr. Clay demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.757 Amendment (A005) offered by Mr. Steil. (consideration: CR H685; text: CR H685)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H.Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Steil amendment No. 5.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.757 On agreeing to the Steil amendment (A005) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.758 Amendment (A006) offered by Mr. Gottheimer. (consideration: CR H685-687; text: CR H685)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H.Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Gottheimer amendment No. 6.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.758 On agreeing to the Gottheimer amendment (A006) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.759 Amendment (A007) offered by Mr. Kildee. (consideration: CR H687-688; text: CR H687)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H. Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Kildee amendment No. 7.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.759 On agreeing to the Kildee amendment (A007) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.760 Amendment (A008) offered by Mr. King (IA). (consideration: CR H688-689; text: CR H688)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H. Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the King (IA) amendment No. 8.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.760 On agreeing to the King (IA) amendment (A008) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.761 Amendment (A009) offered by Ms. Sanchez. (consideration: CR H689-691; text: CR H689-690)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H. Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Sanchez amendment No. 9.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.761 On agreeing to the Sanchez amendment (A009) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.762 Amendment (A010) offered by Mr. Cohen. (consideration: CR H691-692; text: CR H691)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H. Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Cohen amendment No. 10.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.762 On agreeing to the Cohen amendment (A010) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.763 Amendment (A011) offered by Mr. Cohen. (consideration: CR H692-693; text: CR H692)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H. Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Cohen amendment No. 11.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.763 On agreeing to the Cohen amendment (A011) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.764 Amendment (A012) offered by Mr. Takano. (consideration: CR H693-694; text: CR H693)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H. Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Takano amendment No. 12.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.764 On agreeing to the Takano amendment (A012) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.765 Amendment (A013) offered by Mr. Brown (MD). (consideration: CR H694-695, H698; text: CR H694-695)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H. Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Brown (MD) amendment No. 13.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Brown (MD) amendment, the Chair put the question on agreeing to the amendment, and by voice vote announced that the ayes had prevailed. Mr. Brown (MD) demanded a recorded vote and the Chair postponed further proceedings on agreeing to the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.766 Amendment (A014) offered by Mr. Panetta. (consideration: CR H695-697; text: CR H695)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - Pursuant to the provisions of H. Res. 811, the Committee of the Whole proceeded with 10 minutes of debate on the Panetta amendment No. 14.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.766 On agreeing to the Panetta amendment (A014) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"Mr. Lawson (FL) moved that the Committee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"On motion that the Committee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 3621 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"Considered as unfinished business. (consideration: CR H697-701)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.756 On agreeing to the Clay amendment Agreed to by recorded vote: 231 - 185 (Roll no. 28).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"H.Amdt.765 On agreeing to the Brown (MD) amendment (A013) Agreed to by recorded vote: 376 - 38 (Roll no. 29).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 3621.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"Mr. Hill (AR) moved to recommit with instructions to the Committee on Financial Services. (text: CR H698-699)","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"DEBATE - The House proceeded with 10 minutes of debate on the Hill (AR) motion to recommit with instructions. The instructions contained in the motion seek to require the bill to be reported back to the House with an amendment to add a subsection at the end of Title V entitled \"Limitation with Respect to Protected Expressions\".","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"The previous question on the motion to recommit with instructions was ordered without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"On motion to recommit with instructions Failed by the Yeas and Nays: 201 - 208 (Roll no. 30).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"On passage Passed by the Yeas and Nays: 221 - 189 (Roll no. 31).","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-29","action":"Motion to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2020-01-30","action":"Received in the Senate.","chamber":"S","chamber_id":115,"importance":1}],"sponsors":[{"people_id":20094,"person_hash":"8q0j3im4","party_id":"1","state_id":52,"party":"D","role_id":1,"role":"Rep","name":"Ayanna Pressley","first_name":"Ayanna","middle_name":"S.","last_name":"Pressley","suffix":"","nickname":"","district":"HD-MA-7","ftm_eid":45365104,"votesmart_id":122700,"opensecrets_id":"N00042581","knowwho_pid":234321,"ballotpedia":"Ayanna_Pressley","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":20089,"person_hash":"bo9op4iq","party_id":"1","state_id":52,"party":"D","role_id":1,"role":"Rep","name":"Alexandria Ocasio-Cortez","first_name":"Alexandria","middle_name":"","last_name":"Ocasio-Cortez","suffix":"","nickname":"","district":"HD-NY-14","ftm_eid":43884749,"votesmart_id":180416,"opensecrets_id":"N00041162","knowwho_pid":624858,"ballotpedia":"Alexandria_Ocasio-Cortez","sponsor_type_id":2,"sponsor_order":2,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"HR811","sast_bill_id":1321457},{"type_id":8,"type":"Related","sast_bill_number":"HB3614","sast_bill_id":1270848},{"type_id":8,"type":"Related","sast_bill_number":"HB3618","sast_bill_id":1270904},{"type_id":8,"type":"Related","sast_bill_number":"HB3622","sast_bill_id":1270906},{"type_id":8,"type":"Related","sast_bill_number":"HB3629","sast_bill_id":1271182},{"type_id":8,"type":"Related","sast_bill_number":"HB3642","sast_bill_id":1271189},{"type_id":8,"type":"Related","sast_bill_number":"HB3621","sast_bill_id":1270911},{"type_id":8,"type":"Related","sast_bill_number":"HB4328","sast_bill_id":1274571},{"type_id":8,"type":"Related","sast_bill_number":"HB5677","sast_bill_id":1319996}],"subjects":[{"subject_id":13477,"subject_name":"Finance and financial sector"},{"subject_id":13126,"subject_name":"Administrative law and regulatory procedures"},{"subject_id":13322,"subject_name":"Civil actions and liability"},{"subject_id":13147,"subject_name":"Consumer affairs"},{"subject_id":13524,"subject_name":"Consumer credit"},{"subject_id":81071,"subject_name":"Debt collection"},{"subject_id":13215,"subject_name":"Higher education"},{"subject_id":13286,"subject_name":"Student aid and college costs"},{"subject_id":13134,"subject_name":"Appropriations"},{"subject_id":13478,"subject_name":"Banking and financial institutions regulation"},{"subject_id":13413,"subject_name":"Business records"},{"subject_id":20565,"subject_name":"Computer security and identity theft"},{"subject_id":13146,"subject_name":"Congressional oversight"},{"subject_id":20665,"subject_name":"Consumer Financial Protection Bureau"},{"subject_id":13594,"subject_name":"Contracts and agency"},{"subject_id":13479,"subject_name":"Credit and credit markets"},{"subject_id":13406,"subject_name":"Crime victims"},{"subject_id":13373,"subject_name":"Criminal investigation, prosecution, interrogation"},{"subject_id":13374,"subject_name":"Criminal justice information and records"},{"subject_id":13152,"subject_name":"Department of Commerce"},{"subject_id":13156,"subject_name":"Department of Health and Human Services"},{"subject_id":20685,"subject_name":"Employee hiring"},{"subject_id":13177,"subject_name":"Employment discrimination and employee rights"},{"subject_id":13184,"subject_name":"Executive agency funding and structure"},{"subject_id":22689,"subject_name":"Foreign language and bilingual programs"},{"subject_id":13309,"subject_name":"Fraud offenses and financial crimes"},{"subject_id":13198,"subject_name":"Government employee pay, benefits, personnel management"},{"subject_id":13200,"subject_name":"Government information and archives"},{"subject_id":22688,"subject_name":"Government studies and investigations"},{"subject_id":13206,"subject_name":"Health care costs and insurance"},{"subject_id":13211,"subject_name":"Health personnel"},{"subject_id":13608,"subject_name":"Hearing, speech, and vision care"},{"subject_id":13403,"subject_name":"Immigration status and procedures"},{"subject_id":13312,"subject_name":"Licensing and registrations"},{"subject_id":13238,"subject_name":"Low- and moderate-income housing"},{"subject_id":13639,"subject_name":"Marketing and advertising"},{"subject_id":13484,"subject_name":"Military personnel and dependents"},{"subject_id":13848,"subject_name":"Minority and disadvantaged businesses"},{"subject_id":13260,"subject_name":"Public contracts and procurement"},{"subject_id":13325,"subject_name":"Racial and ethnic relations"},{"subject_id":13475,"subject_name":"Refugees, asylum, displaced persons"},{"subject_id":13270,"subject_name":"Right of privacy"},{"subject_id":13272,"subject_name":"Rural conditions and development"},{"subject_id":13326,"subject_name":"Sex, gender, sexual orientation discrimination"},{"subject_id":13646,"subject_name":"Urban and suburban affairs and development"},{"subject_id":13297,"subject_name":"Wages and earnings"}],"texts":[{"doc_id":2045791,"date":"2019-07-10","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB3621\/id\/2045791","state_link":"https:\/\/www.congress.gov\/116\/bills\/hr3621\/BILLS-116hr3621ih.pdf","text_size":260209,"text_hash":"773098533bbe7a8de7f1f60428688b9c"},{"doc_id":2073281,"date":"2019-12-10","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB3621\/id\/2073281","state_link":"https:\/\/www.congress.gov\/116\/bills\/hr3621\/BILLS-116hr3621rh.pdf","text_size":339999,"text_hash":"6c1ebd5c04d5002561bb756c2745ca94"},{"doc_id":2117027,"date":"2020-01-30","type":"Engrossed","type_id":4,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB3621\/id\/2117027","state_link":"https:\/\/www.congress.gov\/116\/bills\/hr3621\/BILLS-116hr3621eh.pdf","text_size":518915,"text_hash":"e83727e7adc1980499c716ecd79ad12c"}],"votes":[{"roll_call_id":911057,"date":"2020-01-29","desc":"On agreeing to the Clay amendment H.Amdt.756 RC# 28","yea":231,"nay":185,"nv":0,"absent":19,"total":435,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB3621\/id\/911057","state_link":"https:\/\/clerk.house.gov\/Votes\/202028"},{"roll_call_id":911058,"date":"2020-01-29","desc":"On agreeing to the Brown (MD) amendment (A013) H.Amdt.765 RC# 29","yea":376,"nay":38,"nv":0,"absent":21,"total":435,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB3621\/id\/911058","state_link":"https:\/\/clerk.house.gov\/Votes\/202029"},{"roll_call_id":911059,"date":"2020-01-29","desc":"On motion to recommit with instructions RC# 30","yea":201,"nay":208,"nv":0,"absent":20,"total":429,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB3621\/id\/911059","state_link":"https:\/\/clerk.house.gov\/Votes\/202030"},{"roll_call_id":911060,"date":"2020-01-29","desc":"On passage RC# 31","yea":221,"nay":189,"nv":0,"absent":19,"total":429,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB3621\/id\/911060","state_link":"https:\/\/clerk.house.gov\/Votes\/202031"}],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"type":"Hearing","date":"2020-01-27","time":"17:00","location":"H-313 CAPITOL","description":"House Committee on Rules Hearing"}]}}