{"bill":{"bill_id":1167735,"change_hash":"44845784604e6d41dc87b0992792a638","session_id":1658,"session":{"session_id":1658,"state_id":52,"year_start":2019,"year_end":2020,"prefile":0,"sine_die":1,"prior":1,"special":0,"session_tag":"Regular Session","session_title":"2019-2020 Regular Session","session_name":"116th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/HJR31\/2019","state_link":"https:\/\/www.congress.gov\/bill\/116th-congress\/house-joint-resolution\/31\/all-info","completed":1,"status":4,"status_date":"2019-02-15","progress":[{"date":"2019-01-22","event":1},{"date":"2019-01-22","event":9},{"date":"2019-01-24","event":2},{"date":"2019-02-15","event":3},{"date":"2019-02-15","event":8},{"date":"2019-02-15","event":4}],"state":"US","state_id":52,"bill_number":"HJR31","bill_type":"JR","bill_type_id":"4","body":"H","body_id":114,"current_body":"H","current_body_id":114,"title":"Making consolidated appropriations for the fiscal year ending September 30, 2019, and for other purposes.","description":"(Sec. 3) This section provides that references to \"this Act\" included in any division of this bill refer only to the provisions of the division unless the bill expressly provides otherwise. (Sec. 4) This section specifies that the sums in this bill are appropriated for FY2019. (Sec. 5) This section provides that amounts designated by this bill for Overseas Contingency Operations\/ Global War on Terrorism pursuant to the Balanced Budget and Emergency Deficit Control Act of 1985 are only available (or rescinded, if applicable) if the President subsequently designates the amounts and transmits the designations to Congress. (Sec. 6) This section provides $174,000 for a payment to Joe Anne Jones, widow of the late Representative Walter B. Jones Jr. (Sec. 7) This section changes the title of division O of the Consolidated Appropriations Act, 2018 to \"the Stephen Sepp Wildfire Suppression Funding and Forest Management Activities Act.\" DIVISION A--DEPARTMENT OF HOMELAND SECURITY APPROPRIATIONS ACT, 2019 Department of Homeland Security Appropriations Act, 2019 This division provides FY2019 appropriations for the Department of Homeland Security (DHS), including U.S. Customs and Border Protection, the U.S. Coast Guard, U.S. Immigration and Customs Enforcement, the Transportation Security Administration, the Federal Emergency Management Agency, the Secret Service, and other DHS programs. TITLE I--DEPARTMENTAL MANAGEMENT, OPERATIONS, INTELLIGENCE, AND OVERSIGHT This title provides appropriations for the Office of the Secretary and Executive Management; the Management Directorate, Intelligence, Analysis, and Operations Coordination; and the Office of Inspector General. (Sec. 101) This section requires the DHS Chief Financial Officer to submit monthly budget execution and staffing reports to Congress. (Sec. 102) This section requires the Secretary of Homeland Security to submit a report to the DHS Office of Inspector General (OIG) listing all grants and contracts awarded during FY2018 and FY2019 without a full and open competition. The OIG must review the report for compliance with laws and regulations and submit the results to Congress. (Sec. 103) This section requires DHS to link all contracts that provide award fees to successful acquisition outcomes specified in terms of cost, schedule, and performance. (Sec. 104) This section requires DHS to notify Congress of proposed transfers from the Department of the Treasury Forfeiture Fund to any DHS agency, and prohibits obligation of the funds until Congress approves the transfer. (Sec. 105) This section requires all official costs for the use of government aircraft by DHS to support official travel of the Secretary and the Deputy Secretary to be paid from amounts made available for the Office of the Secretary. (Sec. 106) This section requires DHS to (1) submit to Congress a report on visa overstay data by country; and (2) publish on the DHS website the metrics developed to measure the effectiveness of security between the ports of entry, including the methodology and data supporting the measures. TITLE II--SECURITY, ENFORCEMENT, AND INVESTIGATIONS This title provides appropriations to U.S. Customs and Border Protection (CBP) for (1) Operations and Support; (2) and Procurement, Construction, and Improvements. The title provides appropriations to U.S Immigration and Customs Enforcement (ICE) for (1) Operations and Support; (2) and Procurement, Construction, and Improvements. The title provides appropriations to the Transportation Security Administration (TSA) for Operations and Support; Procurement, Construction, and Improvements; and Research and Development. The title provides appropriations to the U.S. Coast Guard for Operations and Support; Procurement, Construction, and Improvements; Research and Development; and Retired Pay. The title provides appropriations to the Secret Service for Operations and Support; Procurement, Construction, and Improvements; and Research and Development. (Sec. 201) This section limits overtime compensation for employees of CBP, ICE, and the Secret Service except in individual cases that DHS determines to be necessary for national security purposes, to prevent excessive costs, or in cases of immigration emergencies. (Sec. 202) This section permits specified CBP funds to be used for customs expenses when necessary to maintain operations and prevent adverse personnel actions in Puerto Rico. (Sec. 203) This section provides that specified fees collected from passengers arriving from Canada, Mexico, or an adjacent island, pursuant to the United States-Colombia Trade Promotion Agreement Implementation Act and the Consolidated Omnibus Budget Reconciliation Act of 1985, shall be available until expended. (Sec. 204) This section permits the CBP to access certain reimbursements for preclearance activities. (Sec. 205) This section prohibits the CBP from using funds provided by this division to prevent individuals from importing personal use quantities of certain prescription drugs from Canada. (Sec. 206) This section prohibits funds from being used to waive navigation and vessel inspection laws for the transportation of crude oil distributed from the Strategic Petroleum Reserve until DHS takes adequate measures to ensure the use of U.S. flag vessels. (Sec. 207) This section prohibits DHS from collecting new border crossing fees or conducting a study related to the imposition of a border crossing fee. (Sec. 208) This section permits DHS to reprogram and transfer funds within and into the ICE Operations and Support account as necessary to ensure the detention of aliens prioritized for removal. (Sec. 209) This section prohibits funds provided for the ICE Operations and Support account from being used to continue a delegation of law enforcement authority authorized under specified provisions of the Immigration and Nationality Act if the DHS Inspector General determines that the terms of the agreement governing the delegation of authority have been materially violated. (Sec. 210) This section prohibits ICE Operations and Support funds from being used to continue any contract for the provision of detention services if the two most recent overall performance evaluations received by the facility are less than \"adequate\" or the equivalent median score in any subsequent performance evaluation system. (Sec. 211) This section prohibits the TSA from exempting Members of Congress and specified federal officials from federal passenger and baggage screening. (Sec. 212) This section requires any award by the TSA to deploy explosives detection systems to be based on risk, the airport's current reliance on other screening solutions, lobby congestion resulting in increased security concerns, high injury rates, airport readiness, and increased cost effectiveness. (Sec. 213) This section permits the TSA to use funds from the Aviation Security Capital Fund for the procurement and installation of explosives detection systems or for the issuance of other transaction agreements to fund certain airport security improvement projects authorized under current law. (Sec. 214) This section prohibits the TSA from using funds to require airport operators to provide airport-financed staffing to monitor exit points from the sterile area of any airport at which the TSA provided monitoring as of December 1, 2013. (Sec. 215) This section prohibits funds provided by this division for Coast Guard Operations and Support from being used for recreational vessel expenses, except to the extent fees are collected from owners of yachts and credited to the account. (Sec. 216) This section permits specified funds to be reprogrammed to or from the Military Pay and Allowances funding category within the Coast Guard Operations and Support account. (Sec. 217) This section requires the Coast Guard to submit to Congress a future-years capital investment plan. (Sec. 218) This section permits the Secret Service to obligate funds in anticipation of reimbursements from executive agencies for personnel receiving training sponsored by the James J. Rowley Training Center, except that total obligations at the end of the fiscal year may not exceed budgetary resources available for the Operations and Support account. (Sec. 219) This section prohibits the Secret Service from using funds for the protection of the head of a federal agency other than the Secretary of Homeland Security, except where it has entered into an agreement to provide the protection on a fully reimbursable basis. (Sec. 220) This section permits the Secret Service to reprogram specified funds within the Operations and Support account. (Sec. 221) This section permits funds provided to the Secret Service for Operations and Support to be used for travel of employees on protective missions without regard to limitations on the expenditures if Congress is notified in advance. (Sec. 222) This section requires DHS to submit to Congress an expenditure plan for funds provided for the CBP Procurement, Construction, and Improvements account. The funds may not be obligated until the plan is submitted. (Sec. 223) This section permits funds provided to the Coast Guard Operations and Support account for Overseas Contingency Operations\/ Global War on Terrorism to be allocated by program, project, and activity, notwithstanding the reprogramming and transfer requirements included in section 503 of this division. (Sec. 224) This section prohibits DHS from using funds to place in detention or remove sponsors, potential sponsors, or members of the household of a sponsor or potential sponsor of unaccompanied children based on information provided by the Department of Health and Human Services Office of Refugee Resettlement as part of the sponsor's application to accept custody of an unaccompanied child, except when a background check reveals specified information. (Sec. 225) This section permits the TSA to conduct a pilot program to enter into up to eight reimbursable agreements with TSA-regulated entities for screening services provided by TSA Officers at locations other than primary passenger terminal screening areas. (Sec. 226) This section requires ICE to submit to Congress specified data on aliens detained and enrollees in the Alternatives to Detention program. (Sec. 227) This section prohibits funds provided by this division from being used to reduce the Coast Guard's Operating Systems Center mission or the Coast Guard's government-employed or contract staff levels. (Sec. 228) This section prohibits funds provided by this division from being used to conduct or implement the results of a competition with respect to the Coast Guard National Vessel Documentation Center, pursuant to Office of Management and Budget Circular A-76. (Sec. 229) This section permits funds provided by this division to be used to alter operations within the Coast Guard's Civil Engineering Program, except that no funds may be used to reduce operations within any civil engineering unit unless specifically authorized by a statute enacted after this division is enacted. (Sec. 230) This section provides specified funds to the CBP Procurement, Construction, and Improvements account for the construction of primary pedestrian fencing, including levee pedestrian fencing, in the Rio Grande Valley Sector; the acquisition and deployment of border security technologies and trade and travel assets and infrastructure, including funding for non-intrusive inspection equipment at ports of entry; and construction and facility improvements, including funds for humanitarian needs, Office of Field Operations facilities, and Border Patrol station facility improvements. The funds for primary fencing may only be used for operationally effective designs deployed as of the date of the Consolidated Appropriations Act, 2017, such as currently deployed steel bollard designs, that prioritize agent safety. DHS must submit to Congress and the GAO an updated risk-based plan for improving security along the borders of the United States that includes specified elements. (Sec. 231) This section prohibits funds from being used for the construction of pedestrian fencing within the Santa Ana Wildlife Refuge, within the Bentsen-Rio Grande Valley State Park, within La Lomita Historical Park, within the National Butterfly Center, or within or east of the Vista del Mar Ranch tract of the Lower Rio Grande Valley National Wildlife Refuge. (Sec. 232) This section requires a consultation and public comment period prior to constructing physical barriers within specified cities in Texas. TITLE III--PROTECTION, PREPAREDNESS, RESPONSE, AND RECOVERY This title provides appropriations to the Cybersecurity and Infrastructure Security Agency for Operations and Support; the Federal Protective Service; Procurement, Construction, and Improvements; and Research and Development. The title provides appropriations to the Federal Emergency Management Agency (FEMA) for Operations and Support; Procurement, Construction, and Improvements; Federal Assistance; the Disaster Relief Fund; and the National Flood Insurance Fund. (Sec. 301) This section requires the Federal Protective Service, in conjunction with the Office of Management and Budget, to submit to Congress a plan providing at least three options for a revised method to assess and allocate costs for countermeasures. (Sec. 302) This section limits expenses for the administration of FEMA grants. (Sec. 303) This section specifies time frames for FEMA grant applications and awards. (Sec. 304) This section requires FEMA to brief Congress in advance of announcing certain grants and awards. (Sec. 305) This section specifies that, for the purpose of certain FEMA grants, the installation of communications towers is not considered construction of a building or other physical facility. (Sec. 306) This section extends and modifies reporting requirements for expenditures from FEMA's Disaster Relief Fund. (Sec. 307) This section permits DHS to waive specified requirements of the Federal Fire Prevention and Control Act of 1974 when making Firefighter Assistance Grants. (Sec. 308) This section provides for the receipt and expenditure of fees collected for the Radiological Emergency Preparedness Program. (Sec. 309) This section requires the federal share of assistance to be at least 90% of the costs for certain assistance provided for major disasters declared for wildfires in 2018. TITLE IV--RESEARCH, DEVELOPMENT, TRAINING, AND SERVICES This title provides appropriations for U.S. Citizenship and Immigration Services (USCIS) for Operations and Support; Procurement, Construction, and Improvements; and Federal Assistance. The title provides appropriations to the Federal Law Enforcement Training Centers (FLETCs) for (1) Operations and Support; and (2) Procurement, Construction, and Improvements. The title provides appropriations for the Science and Technology Directorate for (1) Operations and Support, and (2) Research and Development. The title provides appropriations for the Countering Weapons of Mass Destruction Office for Operations and Support; Procurement, Construction, and Improvements; Research and Development; and Federal Assistance. (Sec. 401) This section permits the USCIS to (1) acquire, operate, equip, and dispose of up to five vehicles, for replacement only, for areas where the General Services Administration does not provide vehicles for lease; and (2) authorize employees who are assigned to those areas to use the vehicles to travel between their residences and places of employment. (Sec. 402) This section prohibits the USCIS from using funds provided by this division to grant an immigration benefit to an individual unless required background checks have been completed, the results have been received by the USCIS, and the results do not preclude the granting of the benefit. (Sec. 403) This section prohibits funds provided by this division from being used for a competition for services provided by USCIS employees known as Immigration Information Officers, Immigration Service Analysts, Contact Representatives, Investigative Assistants, or Immigration Services Officers. (Sec. 404) This section permits FLETCs to distribute funds to federal law enforcement agencies for expenses incurred participating in training accreditation. (Sec. 405) This section directs the Federal Law Enforcement Training Accreditation Board to lead the federal law enforcement training accreditation process to measure and assess federal law enforcement training programs, facilities, and instructors. (Sec. 406) This section allows the FLETCs to accept transfers from other government agencies for the Procurement, Construction, and Improvements account. (Sec. 407) This section classifies the functions of the FLETC instructor staff as inherently governmental (rather than commercial, which would require source competition) for the purposes of the Federal Activities Inventory Reform Act of 1998. (Sec. 408) This section allows personnel and specified unexpended balances of funds from the DHS Science and Technology Directorate--Operations and Support account to be transferred to the Department of Agriculture to support operations of the National Bio and Agro-defense Facility. TITLE V--GENERAL PROVISIONS (Sec. 501) This section prohibits appropriations provided by this division from remaining available for obligation beyond the current fiscal year unless the authority is expressly provided by this division. (Sec. 502) This section permits unexpended balances of prior appropriations to be transferred and merged to new accounts and used for the same purpose, subject to reprogramming guidelines. (Sec. 503) This section sets forth restrictions, guidelines, and requirements for the reprogramming and transfer of funds provided by this division. (Sec. 504) This section extends the authority for the DHS Working Capital Fund (WCF) and prohibits DHS from using funds to make payments to the WCF, except for activities and amounts allowed in the President's FY2019 budget. It also permits funds provided to the WCF to remain available until expended and sets forth restrictions and requirements for the WCF. (Sec. 505) This section permits up to 50% of the unobligated balances from each Operations and Support appropriation to remain available through FY2020, subject to the congressional notification requirements included in section 503. (Sec. 506) This section deems funds provided by this division for intelligence activities to be specifically authorized during FY2019 until the enactment of an Act authorizing intelligence activities for FY2019. (Sec. 507) This section requires DHS to notify Congress prior to executing or announcing certain grant allocations, grant awards, contract awards, task or delivery orders, other transaction agreements, or letters of intent. A waiver is permitted if compliance would pose a substantial risk to human life, health, or safety and DHS notifies Congress after the award is made. (Sec. 508) This section prohibits any agency from purchasing, constructing, or leasing any additional facilities, except within or contiguous to existing locations, for federal law enforcement training without notifying Congress in advance. FLETCs may obtain the temporary use of additional facilities for training that cannot be accommodated in existing facilities. (Sec. 509) This section prohibits funds provided by this division from being used for a construction, repair, alteration, or acquisition project for which a required prospectus has not been approved. (Sec. 510) This section applies provisions of the Department Homeland Security Appropriations Act, 2008 related to a contracting officer's technical representative training, disclosure of sensitive security information, and minimum federal fleet requirements to funds provided by this division. (Sec. 511) This section prohibits funds provided by this division from being used in contravention of the Buy American Act. (Sec. 512) This section prohibits funds provided by this division from being used to amend the oath of allegiance required by the Immigration and Nationality Act. (Sec. 513) This section prohibits DHS from using funds provided by this division to carry out a reorganization unless it is explicitly authorized by Congress. (Sec. 514) This section prohibits funds provided by this division from being used for a national identification card. (Sec. 515) This section prohibits officials from delegating this division's requirements to report or certify to Congress unless specifically authorized by this division. (Sec. 516) This section prohibits funds from being used to transfer or release individuals detained at U.S. Naval Station, Guantanamo Bay, Cuba, to or within the United States, its territories, or its possessions. (Sec. 517) This section prohibits funds provided by this division from being used for first-class travel by employees of agencies funded by the division. (Sec. 518) This section prohibits the use of funds provided by this division to employ workers who are illegal workers under the Immigration and Nationality Act. (Sec. 519) This section prohibits funds provided by this division from being used to pay award or incentive fees for contractor performance that is below satisfactory or fails to meet the basic requirements of a contract. (Sec. 520) This section prohibits DHS from entering into contracts that do not meet requirements of specified contracting laws and regulations. (Sec. 521) This section provides appropriations to remain available through FY2020 for financial systems modernization. The funds may be transferred between appropriations accounts for the same purpose if Congress is notified in advance. (Sec. 522) This section requires DHS to reduce administrative expenses by a total of $12 million from specified accounts. (Sec. 523) This section prohibits funds provided by this division from being used for a computer network unless pornography is blocked, with exceptions for law enforcement, prosecution, or adjudication activities. (Sec. 524) This section prohibits a federal law enforcement officer from using funds provided by this division to transfer a firearm to an agent of a drug cartel unless U.S. law enforcement personnel continuously monitor or control the firearm. (Sec. 525) This section sets forth restrictions and reporting requirements for the use of funds provided by this division to attend international conferences. (Sec. 526) This section prohibits funds provided by this division from being used to reimburse any federal department or agency for participation in a National Special Security Event. (Sec. 527) This section prohibits funds from being used for structural pay reform that affects more than 100 full-time equivalent employee positions or costs more than $5 million in a single year without notifying Congress in advance. (Sec. 528) This section requires agencies receiving funds in this division to post reports required to be submitted to Congress on the public website of the agency if it serves the national interest, subject to exceptions for national security or proprietary information. (Sec. 529) This section permits funds provided by this division for Operations and Support to be used for minor procurement, construction, and improvements (end items with a unit cost of $250,000 or less for personal property and $2 million or less for real property). (Sec. 530) This section permits DHS to use funds for the primary and secondary schooling (including transportation) of dependents of DHS personnel who are stationed outside of the continental United States in certain areas where the available schools are unable to provide adequately for the education of the dependents. (Sec. 531) This section provides appropriations to FEMA to reimburse extraordinary law enforcement personnel costs for protection activities directly and demonstrably associated with any residence of the President that is designated or identified to be secured by the Secret Service. (Sec. 532) This section prohibits funds provided by this division from being used to (1) prevent a Member of Congress from entering, for the purpose of conducting oversight, any DHS facility used to detain or otherwise house alien minors; or (2) make any temporary modification to such a facility that alters what is observed by a visiting Member of Congress, compared to what would be observed without the modification. (Sec. 533) This section prohibits funds provided by this division from being used to place restraints on a woman in DHS custody who is pregnant or in post-delivery recuperation, except in specified circumstances. (Sec. 534) This section prohibits funds provided by this division from being used to destroy any document, recording, or other record pertaining to any potential sexual assault or abuse perpetrated against any individual held in the custody of DHS. (Sec. 535) This section prohibits funds provided by this division from being used for any position designated as a Principal Federal Official during a Stafford Act declared disaster or emergency. (Sec. 536) This section prohibits funds provided by this division from being used to implement the Arms Trade Treaty until it is ratified by the Senate. (Sec. 537) This section provides, that within 60 days of submitting a budget proposal for FY2020 that assumes revenues or proposes a reduction from the previous year based on user fees proposals that have not been enacted into law prior to the submission of the budget, DHS must submit to Congress spending reductions to offset revenues assumed in the proposals if they are not enacted. (Sec. 538) This section rescinds specified unobligated balances from various DHS accounts. (Sec. 539) This section rescinds specified unobligated balances from various DHS accounts, including accounts within the TSA, the Coast Guard, and the Domestic Nuclear Detection Office. (Sec. 540) This section rescinds specified unobligated balances from the Department of the Treasury Forfeiture Fund. DIVISION B--AGRICULTURE, RURAL DEVELOPMENT, FOOD AND DRUG ADMINISTRATION, AND RELATED AGENCIES APPROPRIATIONS ACT, 2019 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2019 This division provides FY2019 appropriations for the Department of Agriculture (USDA), except for the Forest Service, which is included in division E (the Department of the Interior, Environment, and Related Agencies Appropriations Act, 2019). The division also provides appropriations for the Food and Drug Administration (FDA) and the Farm Credit Administration. The division includes both discretionary and mandatory funding. The mandatory funding levels are generally set by authorizing legislation such as the farm bill and are frequently limited in the agriculture appropriations bill. TITLE I--AGRICULTURAL PROGRAMS This title provides appropriations for the following agricultural programs and services the Office of the Secretary; Executive Operations; the Office of the Chief Information Officer; the Office of the Chief Financial Officer; the Office of the Assistant Secretary for Civil Rights; the Office of Civil Rights; Agriculture Buildings and Facilities; Hazardous Materials Management; the Office of Inspector General; the Office of the General Counsel; the Office of Ethics; the Office of the Under Secretary for Research, Education, and Economics; the Economic Research Service; the National Agricultural Statistics Service; the Agricultural Research Service; the National Institute of Food and Agriculture; the Office of the Under Secretary for Marketing and Regulatory Programs; the Animal and Plant Health Inspection Service; the Agricultural Marketing Service; the Office of the Under Secretary for Food Safety; and the Food Safety and Inspection Service. TITLE II--FARM PRODUCTION AND CONSERVATION PROGRAMS This title provides appropriations for Farm Production and Conservation programs, including the Office of the Under Secretary for Farm Production and Conservation, the Farm Production and Conservation Business Center, the Farm Service Agency, the Risk Management Agency, and the Natural Resources Conservation Service. The title also provides appropriations for (1) the Federal Crop Insurance Corporation Fund, and (2) the Commodity Credit Corporation Fund. TITLE III--RURAL DEVELOPMENT PROGRAMS This title provides appropriations for Rural Development Programs, including Rural Development Salaries and Expenses, the Rural Housing Service, the Rural Business--Cooperative Service, and the Rural Utilities Service. TITLE IV--DOMESTIC FOOD PROGRAMS This title provides appropriations for the Office of the Under Secretary for Food, Nutrition, and Consumer Services. The title provides appropriations to the Food and Nutrition Service for Child Nutrition Programs; the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC); the Supplemental Nutrition Assistance Program (SNAP, formerly known as the food stamp program); the Commodity Assistance Program; and Nutrition Programs Administration. TITLE V--FOREIGN ASSISTANCE AND RELATED PROGRAMS The title provides appropriations to the Office of the Under Secretary for Trade and Foreign Agricultural Affairs. It also provides appropriations to the Foreign Agricultural Service for the Food for Peace Act (P.L. 480), the McGovern-Dole International Food for Education and Child Nutrition Program, and the Commodity Credit Corporation Export (Loans) Credit Guarantee Program Account. TITLE VI--RELATED AGENCY AND FOOD AND DRUG ADMINISTRATION This title provides appropriations to the Department of Health and Human Services for the Food and Drug Administration (FDA), and the Farm Credit Administration. TITLE VII--GENERAL PROVISIONS (Sec. 701) This section permits USDA to use funds provided by this division for the purchase, replacement, and hire of passenger motor vehicles. (Sec. 702) This section permits USDA to transfer unobligated balances to the Working Capital Fund for the acquisition of plant and capital equipment for financial, administrative, and information technology services. It permits the transferred funds to remain available until expended and specifies restrictions on the use of the funds. (Sec. 703) This section prohibits appropriations provided by this division from remaining available for obligation beyond the current fiscal year unless the division expressly provides otherwise. (Sec. 704) This section limits negotiated indirect costs on cooperative agreements between USDA and nonprofit institutions to 10% of the total direct cost of the agreement when the purpose of the agreement is to carry out programs of mutual interest between the two parties. (Sec. 705) This section permits appropriations for direct and guaranteed loans to remain available until expended to disburse obligations made in the current fiscal year for (1) the Rural Development Loan Fund program account, (2) the Rural Electrification and Telecommunication Loans program account, and (3) the Rural Housing Insurance Fund program account. (Sec. 706) This section prohibits USDA from using funds provided by this division to acquire new information technology systems or significant upgrades without approval of the Chief Information Officer (CIO) and the Executive Information Technology Investment Review Board. It also (1) restricts the transfer of funds made available by this division to the CIO without prior approval of Congress, and (2) prohibits funds from being used for specified information technology projects without the approval of the CIO. (Sec. 707) This section permits specified funds provided under the Federal Crop Insurance Act for the Agricultural Management Assistance Program in the current fiscal year to remain available until expended to disburse obligations made in the current fiscal year. (Sec. 708) This section makes a former Rural Utility Service borrower who has repaid or prepaid a loan under the Rural Electrification Act of 1936 or any not-for-profit utility qualified to receive a loan under the Act eligible for rural economic development and job creation assistance in the same manner as a borrower. (Sec. 709) This section permits specified unobligated balances of appropriations provided by this division for salaries and expenses of the Farm Service Agency and the Rural Development mission area to remain available through FY2020 for information technology expenses. (Sec. 710) This section prohibits funds provided by this division from being used for first-class travel by employees of agencies funded by this division in contravention of specified regulations. (Sec. 711) This section provides that Commodity Credit Corporation funds authorized or required to be used for specified programs included in the Agricultural Act of 2014 (1) shall be available for salaries and administrative expenses associated with the programs without regard to allotment and transfer limits, and (2) the use of the funds for this purpose shall not be considered to be a fund transfer or allotment for purposes of applying the limits. (Sec. 712) This section limits funds available for USDA advisory committees, panels, commissions, and task forces, except for panels used to comply with negotiated rulemakings or to evaluate competitively awarded grants. (Sec. 713) This section prohibits funds provided by this division from being used for a computer network unless pornography is blocked, with the exception of law enforcement, prosecution, or adjudication activities. (Sec. 714) This section limits the amount of Section 32 funds that may be used for certain domestic food assistance programs, including Child Nutrition Programs Entitlement Commodities, State Option Contracts, Removal of Defective Commodities, and Administration of Section 32 Commodity Purchases. (Section 32 is a program created to assist producers of agricultural commodities not supported by other mandatory farm support programs. It is funded by a permanent appropriation of a portion of the previous year's customs receipts less certain mandatory transfers to child nutrition and other programs.) This section also prohibits the use of Section 32 funds to reestablish farmers' purchasing power by making payments in connection with the normal production of any agricultural commodity for domestic consumption. It includes an exception for a limited amount of carryover funds. (Sec. 715) This section prohibits funds from being used to prepare proposals for the President's budget that assume savings from certain user fee proposals without identifying additional spending reductions that should occur if the proposals are not enacted. (Sec. 716) This section sets forth procedures, requirements, and restrictions for reprogramming and transferring funds provided by this division. (Sec. 717) This section permits USDA to assess a one-time fee for any guaranteed business and industry loan and limits the fee to 3% of the guaranteed principal portion of the loan. (Sec. 718) This section prohibits funds from being used to provide reports, questions, or responses to questions that are a result of information requested for the appropriations hearing process to anyone not employed by USDA, the Department of Health and Human Services, or the Farm Credit Administration. (Sec. 719) This section prohibits any executive branch agency from using funds provided by this division to produce a prepackaged news story for U.S. broadcast or distribution unless the story includes a clear notification that it was prepared or funded by the agency. (Sec. 720) This section prohibits USDA employees from being detailed or assigned from an agency funded by this division to any other USDA agency or office for more than 60 days in a fiscal year unless the individual's employing agency is reimbursed by the receiving agency for the salary and expenses of the employee. (Sec. 721) This section prohibits USDA from including incarcerated prison populations to determine eligibility or the level of program assistance for Rural Development programs. (Sec. 722) This section directs the agencies funded by this division to submit spending plans to Congress. (Sec. 723) This section rescinds specified unobligated balances from the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC). (Sec. 724) This section requires USDA to continue an intermediary loan packaging program based on the FY2013 pilot program for packaging and reviewing section 502 single family direct loans. (The loan program assists low-income applicants in purchasing homes in rural areas. Funds may also be used to build, repair, or renovate a house, including providing water and sewage facilities.) (Sec. 725) This section permits USDA to increase the program level by up to 25% for certain loans and loan guarantees that do not require budget authority and have program levels established by this division. USDA must notify Congress before implementing an increase under this section. (Sec. 726) This section provides that certain credit card refunds or rebates transferred to the Working Capital Fund (1) shall not be available for obligation without congressional approval; and (2) shall only be available for the acquisition of plant and capital equipment for USDA financial, administrative, and information technology services. (Sec. 727) This section prohibits funds provided by this division from be used for the variety requirements of the final USDA rule titled \"Enhancing Retailer Standards in the Supplemental Nutrition Assistance Program (SNAP)\" until USDA amends the definition of \"variety\" to increase the number of items that qualify as acceptable varieties in each staple food category so that the total number of such items in each staple food category exceeds the number of such items in each staple food category included in the final rule. Until the amendments are promulgated, USDA must apply the requirements regarding acceptable varieties and breadth of stock to SNAP retailers that were in effect on the day before the enactment of the Agricultural Act of 2014. (Sec. 728) This section prohibits funds provided by this division from being used (1) in contravention of a provision of the Agricultural Act of 2014 that permits an institution of higher education or a state department of agriculture to grow or cultivate industrial hemp for research purposes; or (2) to prohibit the transportation, processing, sale, or use of industrial hemp or seeds of such plant, that is grown or cultivated in accordance with the Agricultural Act of 2014, within or outside the state in which it is grown or cultivated. (Sec. 729) This section sets forth the authorities that apply for USDA to provide loans for housing and buildings on adequate farms. (Sec. 730) This section prohibits funds provided by this division from being used for regulations to allow or require information intended for a prescribing health care professional, in the case of a drug or biological product, to be distributed electronically (in lieu of in paper form) until a federal law is enacted to allow or require electronic distribution. (Sec. 731) This section prohibits the FDA from acknowledging applications for an exemption for investigational use of a drug or biological product in research in which a human embryo is intentionally created or modified to include a heritable genetic modification. Such a submission is deemed not to have been received, and the exemption may not go into effect. (Sec. 732) This section prohibits funds from being used to carry out provisions of the final FDA rule titled \"Current Good Manufacturing Practice and Hazard Analysis and Risk-Based Preventive Controls for Food for Animals\" with respect to certain requirements that apply to the production, distribution, sale, or receipt of dried spent grain by-products of the alcoholic beverage production process. (Sec. 733) This section specifies that funds made available under title II of the Food for Peace Act may only be used to provide assistance to recipient nations if adequate monitoring and controls are in place to ensure that emergency food aid is received by the intended beneficiaries in areas affected by food shortages and not diverted for unauthorized or inappropriate purposes. (Sec. 734) This section prohibits the Food and Nutrition Service from beginning any new research and evaluation projects until a research and evaluation plan for FY2019 is submitted to Congress. (Sec. 735) This section provides additional funds to remain available until expended for the Rural Energy Savings Program. (The program helps rural families and small businesses achieve cost savings by providing loans to consumers to implement durable cost-effective energy efficiency measures.) USDA may allow eligible entities or comparable entities that provide energy efficiency services using their own billing mechanism to offer loans (1) to customers in any part of their service territory, and (2) to replace a manufactured housing unit with another manufactured housing unit, if replacement would be more cost effective in saving energy. (Sec. 736) USDA must conduct and make publicly available audits in a manner that evaluates the following factors in the country or region being audited veterinary control and oversight, disease history and vaccination practices, livestock demographics and traceability, epidemiological separation from potential sources of infection, surveillance practices, diagnostic laboratory capabilities, and emergency preparedness and response. (Sec. 737) This section prohibits the FDA from deeming partially hydrogenated oils to be unsafe or any food containing a partially hydrogenated oil to be adulterated prior to compliance dates that the FDA specified in regulations. (Sec. 738) This section permits the Agricultural Research Service and the Animal and Plant Health Inspection Service to make up to 50 appointments in any fiscal year during FY2019-FY2025 for employees of the agencies at the National Bio- and Agro-defense Facility in Manhattan, Kansas. (Sec. 739) This section provides appropriations for USDA to carry out a pilot program that provides forestry inventory analysis, forest management, and economic outcomes modeling for certain currently enrolled Conservation Reserve Program participants. USDA must allow the Commodity Credit Corporation to enter into agreements with and provide grants to qualified nonprofit organizations dedicated to conservation, forestry and wildlife habitats that also have experience in conducting accurate forest inventory analysis through the use of advanced, cost-effective technology. (Sec. 740) This section provides appropriations to remain available until expended for implementing non-renewable agreements for wetlands preservation on eligible lands, including flooded agricultural lands, under the Water Bank Act. (Sec. 741) This section appropriates funds for direct reimbursement payments for geographically disadvantaged farmers or ranchers to transport agricultural commodities. (Sec. 742) This section prohibits funds provided by this division from being used to issue or renew licenses under the Animal Welfare Act for certain dealers who sell dogs and cats for research, experiments, teaching, or testing. (Sec. 743) This section provides additional appropriations to the Commodity Credit Corporation for the Food for Progress program. (Sec. 744) This section prohibits funds provided for the rural water, waste water, waste disposal, and solid waste management programs authorized by the Consolidated Farm and Rural Development Act from being used for the construction, alteration, maintenance, or repair of a public water or wastewater system unless all of the iron and steel products used in the project are produced in the United States. The section also specifies exceptions and waiver procedures. (Sec. 745) This section directs USDA to set aside specified additional funds for Rural Economic Area Partnership (REAP) Zones. (Sec. 746) This section provides appropriations to remain available until expended for a pilot program for USDA to award grants to nonprofit organizations and public housing authorities to provide technical assistance to Rural Housing Service (RHS) multi-family housing borrowers to facilitate the acquisition of RHS multi-family housing properties in areas where there is a risk of loss of affordable housing. The grants must be used to assist acquisitions by nonprofit housing organizations and public housing authorities that commit to keeping the properties in the RHS multi-family housing program for a period of time determined by USDA. (Sec. 747) This section prohibits funds provided by this division from being used to influence congressional action on any legislation or appropriation matters pending before Congress. (Sec. 748) This section requires USDA to establish a pilot program to permit state Farm Service Agency offices to make county-level payments to agricultural producers under the Agriculture Risk Coverage Program using an alternate calculation method if it is necessary to ensure that there are not significant yield calculation disparities between comparable counties in the state. It also specifies requirements for the alternative calculation method and provides appropriations for the program. (Sec. 749) This section prohibits funds provided by this division from being used to procure raw or processed poultry products from China for the National School Lunch Program, the Child and Adult Food Care Program, the Summer Food Service Program, or the School Breakfast Program. (Sec. 750) This section prohibits funds from being used to inspect horses for slaughter purposes. (Sec. 751) This section permits USDA to respond to a community with inadequate drinking water supplies due to a natural disaster by providing potable water through the Emergency Community Water Assistance Grant Program for up to 120 days beyond the time period established in the program. (Sec. 752) This section requires at least 10% of the funds provided by this division for specified Rural Development programs to be allocated for assistance in persistent poverty counties. A \"persistent poverty county\" is a county that has had at least 20% of its population living in poverty over the past 30 years, as measured by the decennial censuses. (Sec. 753) This section prohibits USDA from using funds to finalize the proposed rule titled \"Eligibility of the People's Republic of China (PRC) to Export to the United States Poultry Products from Birds Slaughtered in the PRC\" unless USDA meets specified requirements, including ensuring that the poultry slaughter inspection system for the PRC is equivalent to that of the United States. (Sec. 754) This section provides appropriations for the Farm to School Grant Program. (The program provides competitive grants and technical assistance to implement farm-to-school programs that improve access to local foods in eligible schools.) (Sec. 755) This section prohibits the FDA from using funds provided by this division to develop, issue, promote, or advance any regulations applicable to food manufacturers for population-wide sodium reduction actions or to develop, issue, promote or advance final guidance applicable to food manufacturers for long term population-wide sodium reduction actions until the dietary reference intake report with respect to sodium is completed. (Sec. 756) This section provides additional funds to USDA for loans and grants that are consistent with the Healthy Food Financing Initiative and that support projects to provide access to healthy food in underserved areas, create and preserve quality jobs, and revitalize low-income communities. (Sec. 757) This section provides additional funds to the Animal and Plant Health Inspection Service to remain available through FY2020 for one-time control and management and associated activities directly related to the multiple-agency response to citrus greening. (Sec. 758) This section prohibits the FDA from using funds to enforce the rule titled \"Standards for the Growing, Harvesting, Packing, and Holding of Produce for Human Consumption\" with respect to the regulation of the production, distribution, sale, or receipt of grapes that are grown, harvested, and used solely for wine and receive commercial processing that adequately reduces the presence of microorganisms of public health significance. (Sec. 759) This section prohibits funds provided by this division from being used to revoke an exception made (1) under the Grain Inspection, Packers and Stockyards Administration rule titled \"Exceptions to Geographic Areas for Official Agencies Under the USGSA\"; and (2) before April 14, 2017. (The rule established criteria to allow more than one designated official agency to inspect or weigh grain within a single geographic area.) (Sec. 760) This section provides that, for the 2019-2020 school year, only school food authorities with a negative balance in the nonprofit school food service account as of December 31, 2018, are required to establish a price for paid lunches using the formula specified under current law (known as Paid Lunch Equity requirements). (Sec. 761) This section provides appropriations for telemedicine and distance learning services in rural areas to help address the opioid epidemic in rural America. (Sec. 762) This section provides additional appropriations for the broadband loan and grant pilot program that was established in the Consolidated Appropriations Act, 2018. (Sec. 763) This section provides additional appropriations for direct loans and grants made under the Rural Water and Waste Disposal Program account. (Sec. 764) This section provides appropriations to the National Institute of Food and Agriculture to remain available through FY2020 for a pilot program to provide grants to nonprofit organizations for programs and services to establish and enhance farming and ranching opportunities for military veterans. (Sec. 765) This section requires the FDA to finalize by September 30, 2019, the draft guidance for industry titled \"Bacterial Risk Control Strategies for Blood Collection Establishments and Transfusion Services to Enhance the Safety and Availability of Platelets for Transfusion\" (Sec. 766) This section requires USDA to report to Congress regarding (1) the process used to establish the 2020-2025 Dietary Guidelines for Americans, and (2) the decision to incorporate or include certain recommendations from the report by the National Academies of Science, Engineering, and Medicine titled \"Redesigning the Process for Establishing the Dietary Guidelines for Americans\" and issued in September 2017. (Sec. 767) This section prohibits funds provided by this division from being used to implement, administer, or enforce the requirement in the rule titled \"Food Labeling: Revision of the Nutrition and Supplement Facts Labels\" that any single ingredient sugar, honey, agave, or syrup (including maple syrup) that is packaged and offered for sale as a single ingredient food bear the declaration \"Includes 'X'g Added Sugars.\" (Sec. 768) This section prohibits funds from being used to implement a portion of a School Breakfast Program regulation that limits substituting fruits with certain vegetables. (Sec. 769) This section requires USDA to provide technical assistance to any state or county impacted by a volcanic eruption covered by major disaster declared by the President in 2018. The technical assistance is for (1) assessing damage to agricultural production and rural infrastructure; and (2) developing recovery plans for impacted farmers, ranchers, and rural communities. (Sec. 770) This section requires USDA, in coordination with the National Oceanic and Atmospheric Administration, to establish a working group to study and report to Congress on specified issues related to ocean farming practices. (Sec. 771) This section requires USDA to report to Congress on (1) ways in which conservation programs administered by the Natural Resources Conservation Service (NRCS) may be better used for the conservation of ocelots (Leopardus pardalis), and (2) actions taken by the NRCS relating to the conservation of ocelots. (Sec. 772) This section requires the Rural Housing Service (RHS) to submit to Congress a report including specified details regarding properties assisted under title V of the Housing Act of 1949 that are reaching the end of their loan term, the strategy to preserve the long-term affordability of the properties when the loan matures, and a description of the resources and tools that the RHS needs from Congress to preserve the long-term affordability of the properties. (Sec. 773) This section requires the FDA to use funds to revise the advice provided in the notice of availability titled \"Advice About Eating Fish, From the Environmental Protection Agency and Food and Drug Administration; Revised Fish Advice; Availability\" in a manner that is consistent with nutrition science recognized by FDA on the net effects of seafood consumption. (Sec. 774) This section provides additional appropriations to the National Institute of Food and Agriculture for grants to the 1890 Institutions to support the Centers of Excellence. (Sec. 775) This section modifies a date related to entitlement purchases for the child nutrition programs to ensure that trade aid purchases do not count toward the required level for commodity assistance. (Sec. 776) This section prohibits the FDA from allowing the introduction or delivery for introduction into interstate commerce of any food that contains genetically engineered salmon until the FDA publishes final labeling guidelines for informing consumers of the content. (Sec. 777) This section provides appropriations for Food for Peace Title II grants and specifies that the funds may be used for both emergency and non-emergency purposes. (Sec. 778) This section provides appropriations to the Farm Service Agency to make payments to producers impacted by an oriental fruit fly quarantine. It also rescinds specified unobligated balances from USDA. (Sec. 779) This section specifies requirements for administering the broadband loan and grant pilot program established by the Consolidated Appropriations Act, 2018. USDA must (1) allow applicants that are determined to be ineligible for the program to appeal the determination in a timely fashion, and (2) exclude certain loans when determining whether an entity may overbuild or duplicate broadband expansion efforts made by any entity that has received a broadband loan from the Rural Utilities Service. (Sec. 780) This section provides additional appropriations for loans and grants authorized under the Rural Microentrepreneur Assistance Program. DIVISION C--COMMERCE, JUSTICE, SCIENCE, AND RELATED AGENCIES APPROPRIATIONS ACT, 2019 Commerce, Justice, Science, and Related Agencies Appropriations Act, 2019 This division provides FY2019 appropriations to the Department of Commerce, the Department of Justice (DOJ), science agencies, and several related agencies. The division funds agencies with a wide range of responsibilities for issues such as addressing violent crime, drug trafficking, financial fraud, terrorism, espionage, and cybercrime; conducting the census; forecasting the weather; managing fisheries; exploring space; advancing science; providing legal services for the poor; enforcing employment discrimination laws; and overseeing patents, trademarks, and trade policy. TITLE I--DEPARTMENT OF COMMERCE This title provides appropriations to the Department of Commerce for the International Trade Administration, the Bureau of Industry and Security, the Economic Development Administration, the Minority Business Development Agency, Economic and Statistical Analysis, the Bureau of the Census, the National Telecommunications and Information Administration, and the U.S. Patent and Trademark Office. The title provides appropriations to the National Institute of Standards and Technology (NIST) for Scientific and Technical Research and Services, Industrial Technology Services, and Construction of Research Facilities. The title provides appropriations to the National Oceanic and Atmospheric Administration (NOAA) for Operations, Research, and Facilities; Procurement, Acquisition, and Construction; Pacific Coastal Salmon Recovery; the Fishermen's Contingency Fund; Fishery Disaster Assistance; and the Fisheries Finance Program Account. The title provides appropriations for Departmental Management for (1) Salaries and Expenses, and (2) the Office of Inspector General. (Sec. 101) This section permits funds provided by this division to be used for advanced payments (prior to the receipt of goods, services, or other assets) that are not otherwise authorized only if designated Commerce officials certify that the payments are in the public interest. (Sec. 102) This section permits funds provided by this division to be used for hiring passenger motor vehicles, employment of temporary or intermittent experts and consultants, and the purchase of uniforms. (Sec. 103) This section permits the transfer of funds between Commerce accounts, subject to specified limitations and requirements. It also requires Commerce to notify Congress prior to the acquisition or disposal of any capital asset not provided for in an Act providing appropriations to Commerce. (Sec. 104) This section extends requirements for NOAA to make and report to Congress on determinations regarding the identification and management of technical, cost, and schedule risk; the reliance on demonstrated technologies; and compliance with relevant policies, prior to entering into a contract for a major program with a life cycle cost of more than $250 million. It also specifies the life cycle costs for the Joint Polar Satellite System and the Geostationary Operational Environmental Satellite R-Series Program. (Sec. 105) This section permits Commerce to (1) furnish services to facilitate the use or occupancy of Department of Commerce buildings, and (2) credit specified reimbursements received for the services to the appropriation or fund that bears the cost of the services. (Sec. 106) This section specifies that grant recipients may continue to deter child pornography, copyright infringement, or any other unlawful activity over their networks. (Sec. 107) This section permits NOAA to use, with consent and reimbursement, resources of other federal, state, local, and international entities to carry out the responsibilities of any statute administered by NOAA. (Sec. 108) This section prohibits the National Technical Information Service from charging for copies of reports or documents generated by the legislative branch unless the service has provided information on how a copy may be obtained for free online. Any charge must be limited to the service's cost. (Sec. 109) This section permits NOAA to work with federal and non-federal agencies and governments by entering into agreements; using land, services, equipment, personnel, and facilities provided by the entities; or receiving and expending funds made available on a consensual basis. (Sec. 110) This section permits the Economic and Statistics Administration, the Bureau of Economic Analysis, and the Census Bureau to use funds to enter into cooperative agreements to assist in improving statistical methodology and research. (Sec. 111) This section permits funds to be used for certain law enforcement activities conducted by states under a joint enforcement agreement entered into pursuant to the Magnuson-Stevens Fishery Conservation and Management Act. (Sec. 112) This section modifies the requirements for using funding that was provided to NOAA by the Further Additional Supplemental Appropriations for Disaster Relief Requirements Act, 2018 for expenses related to the consequences of Hurricanes Harvey, Irma, and Maria. TITLE II--DEPARTMENT OF JUSTICE Department of Justice Appropriations Act, 2019 This title provides FY2019 appropriations to the Department of Justice (DOJ). The title provides appropriations to DOJ for General Administration, including Salaries and Expenses, Justice Information Sharing Technology, the Executive Office for Immigration Review, and the Office of Inspector General. The title provides appropriations to the U.S. Parole Commission. The title provides appropriations for Legal Activities, including General Legal Activities, the Antitrust Division, the U.S. Attorneys, the U.S. Trustee System Fund, the Foreign Claims Settlement Commission, Fees and Expenses of Witnesses, the Community Relations Service, and the Assets Forfeiture Fund. The title provides appropriations to the U.S. Marshals Service for Salaries and Expenses, Construction, and Federal Prisoner Detention. The title provides appropriations to DOJ for the National Security Division; Interagency Law Enforcement; the Federal Bureau of Investigation (FBI); the Drug Enforcement Administration (DEA); the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF); and the Federal Prison System. The title provides appropriations to the Office On Violence Against Women for Violence Against Women Prevention and Prosecution Programs. The title provides appropriations to the Office of Justice Programs for Research, Evaluation, and Statistics; State and Local Law Enforcement Assistance; Juvenile Justice Programs; and Public Safety Officer Benefits. The title provides appropriations for Community Oriented Policing Services (COPS) programs. (Sec. 201) This section provides additional funds to the Attorney General for official reception and representation expenses. (Sec. 202) This section prohibits funds provided by this title from being used to pay for an abortion, except where the life of the mother would be endangered if the fetus were carried to term, or in the case of rape or incest. (Sec. 203) This section prohibits funds provided by this title from being used to require any person to perform or facilitate the performance of an abortion. (Sec. 204) This section specifies that (1) section 203 of this division does not remove the obligation of the Bureau of Prisons to provide escort services to an inmate receiving an abortion outside of a federal facility, and (2) nothing in this section diminishes the effect of section 203 intended to address the philosophical beliefs of individual employees of the Bureau of Prisons. (Sec. 205) This section sets forth requirements and procedures for transferring and reprogramming DOJ funds provided by this division. (Sec. 206) This section prohibits the FBI or the Marshals Service from using funds provided by this title to transport prisoners classified as maximum or high security, other than to a facility certified by the Bureau of Prisons as appropriately secure. (Sec. 207) This section prohibits federal prisons from using funds provided by this division to purchase cable television services, or to rent or purchase audiovisual or electronic media or equipment used primarily for recreational purposes. Exceptions are included for inmate training, religious, or educational programs. (Sec. 208) This section prohibits funds provided by this title from being used for a new or enhanced information technology program with estimated development costs exceeding $100 million unless the Deputy Attorney General and the Department Investment Review Board certify to Congress that the program (1) has appropriate program management controls and contractor oversight mechanisms in place, and (2) is compatible with DOJ enterprise architecture. (Sec. 209) This section requires DOJ to follow reprogramming procedures for (1) any deviation from the program amounts specified in this division or the explanatory statement, or (2) for any use of deobligated balances of funds provided by this title in previous years. (Sec. 210) This section prohibits funds provided by this division from being used for a public-private competition for work performed by employees by the Bureau of Prisons or Federal Prison Industries, Incorporated. (Sec. 211) This section prohibits U.S. Attorneys from holding dual or additional responsibilities that exempt them from statutory residency requirements. (Sec. 212) This section permits specified grant and reimbursement program funds made available to the Office of Justice Programs to be used for training and technical assistance. It also permits specified funds to be used for criminal justice research, evaluations, and statistics by the National Institute of Justice and the Bureau of Justice Statistics for the grant or reimbursement programs. (Sec. 213) This section permits DOJ to waive matching requirements for Second Chance Act adult and juvenile reentry demonstration projects; state, tribal, and local reentry courts; and drug treatment programs. (Sec. 214) This section waives the requirement that DOJ reserve certain funds provided for offender incarceration for payments for incarceration on tribal lands. (Sec. 215) This section prohibits funds, other than funds for the National Instant Criminal Background Check System established under the Brady Handgun Violence Prevention Act, from being used to transfer an operable firearm to a known or suspected agent of a drug cartel if law enforcement personnel do not continuously monitor or control the firearm. (Sec. 216) This section establishes limitations and requirements for the obligation of sp","pending_committee_id":0,"committee":[],"referrals":[{"date":"2019-01-22","committee_id":2298,"chamber":"H","chamber_id":114,"name":"Appropriations"}],"history":[{"date":"2019-01-22","action":"Introduced in House","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-22","action":"Rules Committee Resolution H. Res. 61 Reported to House. Rule provides for consideration of H.R. 648 and H.J. Res. 31. Rule provides for consideration of H.R. 648 and H.J. Res. 31 under closed rules with one hour of debate for each measure. Rule provides for consideration of motions to suspend the rules through the legislative day of February 1, 2019","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-22","action":"Referred to the House Committee on Appropriations.","chamber":"H","chamber_id":114,"importance":1},{"date":"2019-01-23","action":"Rule H. Res. 61 passed House.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"Considered under the provisions of rule H. Res. 61. (consideration: CR H1176-1181)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"Rule provides for consideration of H.R. 648 and H.J. Res. 31. Rule provides for consideration of H.R. 648 and H.J. Res. 31 under closed rules with one hour of debate for each measure. Rule provides for consideration of motions to suspend the rules through the legislative day of February 1, 2019","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"DEBATE - The House proceeded with one hour of debate on H.J. Res. 31.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"Ms. Granger moved to recommit with instructions to the Committee on Appropriations. (text: CR H1181)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"DEBATE - The House proceeded with 10 minutes of debate on the Granger motion to recommit with instructions. The instructions contained in the motion seek to require the bill to be reported back to the House with an amendment striking the date February 28, 2019 and inserting January 24, 2019 on page 2, line 10.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"The previous question on the motion to recommit with instructions was ordered without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the motion to recommit, the Chair put the question on agreeing to the motion and by voice vote, announced that the nays had prevailed. Ms. Granger demanded the yeas and nays and the Chair postponed further proceedings on the motion to recommit until later in the legislative day.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"Considered as unfinished business. (consideration: CR H1181-1183)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"On motion to recommit with instructions Failed by the Yeas and Nays: 200 - 214 (Roll no. 50).","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"On passage Passed by the Yeas and Nays: 231 - 180 (Roll no. 51). (text: CR H1176-1177)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"Motion to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-24","action":"Received in the Senate. Read the first time. Placed on Senate Legislative Calendar under Read the First Time.","chamber":"S","chamber_id":115,"importance":1},{"date":"2019-01-25","action":"The joint resolution was considered read the second time.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-25","action":"Measure laid before Senate by unanimous consent. (consideration: CR S684)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-25","action":"S.Amdt.55 Amendment SA 55 proposed by Senator McConnell for Senator Shelby. (consideration: CR S684; text: CR S684) In the nature of a substitute.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-25","action":"S.Amdt.55 Amendment SA 55 agreed to in Senate by Unanimous Consent.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-25","action":"Passed Senate with an amendment by Voice Vote.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-25","action":"Senate insists on its amendment, asks for a conference, appoints conferees Shelby; Capito; Hoeven; Blunt; Leahy; Durbin; Tester.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-25","action":"Message on Senate action sent to the House.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-01-25","action":"Mrs. Lowey asked unanimous consent to take from the Speaker's table, with the Senate amendment thereto, disagree to the Senate amendment, and agree to the conference requested by the Senate. (consideration: CR H1216)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-25","action":"On motion that the House disagree to the Senate amendment, and agree to a conference Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-25","action":"The Speaker appointed conferees: Lowey, Roybal-Allard, Price of North Carolina, Lee of California, Cuellar, Aguilar, Granger, Fleischmann, Graves of Georgia, and Palazzo. (consideration: CR S684)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-01-30","action":"Conference held.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-02-13","action":"Conferees agreed to file conference report.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-02-13","action":"Conference report H. Rept. 116-9 filed.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-02-14","action":"Conference papers: Senate report and manager's statement and official papers held at the desk in Senate.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-02-14","action":"Conference report considered in Senate. (consideration: CR S1362-1364)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-02-14","action":"Cloture motion on the conference report presented in Senate. (CR S1362)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-02-14","action":"Cloture on the conference report invoked in Senate by Yea-Nay Vote. 84 - 15. Record Vote Number: 25. (CR S1364)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-02-14","action":"Senate agreed to conference report by Yea-Nay Vote. 83 - 16. Record Vote Number: 26.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-02-14","action":"Message on Senate action sent to the House.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-02-14","action":"Mrs. Lowey brought up conference report H. Rept. 116-9 for consideration under the provisions of H. Res. 131. (consideration: CR H2016-2024)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-02-14","action":"DEBATE - The House proceeded with one hour of debate on the conference report to accompany H.J.Res. 31.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-02-14","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-02-14","action":"On agreeing to the conference report Agreed to by the Yeas and Nays: 300 - 128 (Roll No. 87). (text: CR 2\/13\/2019 H1590-1713)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-02-14","action":"Motions to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-02-14","action":"Pursuant to the provisions of S. Con. Res. 4, enrollment corrections on H.J. Res. 31 have been made.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-02-15","action":"Presented to President.","chamber":"H","chamber_id":114,"importance":1},{"date":"2019-02-15","action":"Signed by President.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-02-15","action":"Became Public Law No: 116-6. (TXT | PDF)","chamber":"H","chamber_id":114,"importance":1}],"sponsors":[{"people_id":9117,"person_hash":"2m022k5d","party_id":"1","state_id":52,"party":"D","role_id":1,"role":"Rep","name":"Lucille Roybal-Allard","first_name":"Lucille","middle_name":"","last_name":"Roybal-Allard","suffix":"","nickname":"","district":"HD-CA-40","ftm_eid":12450156,"votesmart_id":26766,"opensecrets_id":"N00006671","knowwho_pid":158750,"ballotpedia":"Lucille_Roybal-Allard","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"HR61","sast_bill_id":1167776},{"type_id":8,"type":"Related","sast_bill_number":"HJR1","sast_bill_id":1137404},{"type_id":8,"type":"Related","sast_bill_number":"HR131","sast_bill_id":1205615},{"type_id":8,"type":"Related","sast_bill_number":"SCR4","sast_bill_id":1205715},{"type_id":8,"type":"Related","sast_bill_number":"HB21","sast_bill_id":1137447},{"type_id":8,"type":"Related","sast_bill_number":"HB264","sast_bill_id":1142081},{"type_id":8,"type":"Related","sast_bill_number":"HB265","sast_bill_id":1142036},{"type_id":8,"type":"Related","sast_bill_number":"HB266","sast_bill_id":1141975},{"type_id":8,"type":"Related","sast_bill_number":"HB267","sast_bill_id":1142026},{"type_id":8,"type":"Related","sast_bill_number":"HB648","sast_bill_id":1161195},{"type_id":8,"type":"Related","sast_bill_number":"SB291","sast_bill_id":1184985},{"type_id":8,"type":"Related","sast_bill_number":"HB1122","sast_bill_id":1198249},{"type_id":8,"type":"Related","sast_bill_number":"HB684","sast_bill_id":1161143},{"type_id":8,"type":"Related","sast_bill_number":"SB168","sast_bill_id":1157020}],"subjects":[{"subject_id":13134,"subject_name":"Appropriations"},{"subject_id":13157,"subject_name":"Department of Homeland Security"},{"subject_id":13184,"subject_name":"Executive agency funding and structure"},{"subject_id":13198,"subject_name":"Government employee pay, benefits, personnel management"},{"subject_id":13284,"subject_name":"State and local finance"},{"subject_id":13124,"subject_name":"Economics and public finance"},{"subject_id":20814,"subject_name":"Access Board"},{"subject_id":13814,"subject_name":"Administrative Conference of the U.S."},{"subject_id":13129,"subject_name":"Agricultural conservation and pollution"},{"subject_id":13817,"subject_name":"Agricultural marketing and promotion"},{"subject_id":13401,"subject_name":"Agricultural practices and innovations"},{"subject_id":13818,"subject_name":"Agricultural prices, subsidies, credit"},{"subject_id":13130,"subject_name":"Agricultural research"},{"subject_id":13780,"subject_name":"Alaska Natives and Hawaiians"},{"subject_id":13405,"subject_name":"Asia"},{"subject_id":13135,"subject_name":"Aviation and airports"},{"subject_id":13136,"subject_name":"Border security and unlawful immigration"},{"subject_id":13489,"subject_name":"Caribbean area"},{"subject_id":13476,"subject_name":"Census and government statistics"},{"subject_id":13142,"subject_name":"Child health"},{"subject_id":13732,"subject_name":"China"},{"subject_id":21500,"subject_name":"Climate change and greenhouse gases"},{"subject_id":13813,"subject_name":"Coast guard"},{"subject_id":20565,"subject_name":"Computer security and identity theft"},{"subject_id":13146,"subject_name":"Congressional oversight"},{"subject_id":13638,"subject_name":"Consumer Product Safety Commission"},{"subject_id":13583,"subject_name":"Cuba"},{"subject_id":20695,"subject_name":"Customs enforcement"},{"subject_id":13151,"subject_name":"Department of Agriculture"},{"subject_id":13152,"subject_name":"Department of Commerce"},{"subject_id":13156,"subject_name":"Department of Health and Human Services"},{"subject_id":13158,"subject_name":"Department of Housing and Urban Development"},{"subject_id":13159,"subject_name":"Department of Justice"},{"subject_id":13161,"subject_name":"Department of State"},{"subject_id":13162,"subject_name":"Department of Transportation"},{"subject_id":13164,"subject_name":"Department of the Interior"},{"subject_id":13165,"subject_name":"Department of the Treasury"},{"subject_id":13444,"subject_name":"Detention of persons"},{"subject_id":13439,"subject_name":"Disaster relief and insurance"},{"subject_id":13167,"subject_name":"District of Columbia"},{"subject_id":13593,"subject_name":"Drug safety, medical device, and laboratory regulation"},{"subject_id":13168,"subject_name":"Economic development"},{"subject_id":13501,"subject_name":"Election Assistance Commission"},{"subject_id":13174,"subject_name":"Elementary and secondary education"},{"subject_id":13472,"subject_name":"Emergency planning and evacuation"},{"subject_id":13182,"subject_name":"Environmental Protection Agency (EPA)"},{"subject_id":322387,"subject_name":"Environmental education"},{"subject_id":13183,"subject_name":"Executive Office of the President"},{"subject_id":14041,"subject_name":"Farm Credit Administration"},{"subject_id":13634,"subject_name":"Federal Communications Commission (FCC)"},{"subject_id":13832,"subject_name":"Federal Deposit Insurance Corporation (FDIC)"},{"subject_id":13833,"subject_name":"Federal Election Commission (FEC)"},{"subject_id":13810,"subject_name":"Federal Emergency Management Agency (FEMA)"},{"subject_id":13707,"subject_name":"Federal Labor Relations Authority"},{"subject_id":13834,"subject_name":"Federal Maritime Commission"},{"subject_id":13514,"subject_name":"Federal Trade Commission (FTC)"},{"subject_id":13341,"subject_name":"Firearms and explosives"},{"subject_id":13188,"subject_name":"Fires"},{"subject_id":13415,"subject_name":"Fishes"},{"subject_id":13189,"subject_name":"Floods and storm protection"},{"subject_id":13787,"subject_name":"Food and Drug Administration (FDA)"},{"subject_id":13190,"subject_name":"Food assistance and relief"},{"subject_id":13521,"subject_name":"Food supply, safety, and labeling"},{"subject_id":13456,"subject_name":"Foreign aid and international relief"},{"subject_id":22687,"subject_name":"Forests, forestry, trees"},{"subject_id":13194,"subject_name":"General Services Administration"},{"subject_id":13506,"subject_name":"Genetics"},{"subject_id":13202,"subject_name":"Government lending and loan guarantees"},{"subject_id":13203,"subject_name":"Government trust funds"},{"subject_id":13205,"subject_name":"Hazardous wastes and toxic substances"},{"subject_id":13212,"subject_name":"Health programs administration and funding"},{"subject_id":13214,"subject_name":"Health technology, devices, supplies"},{"subject_id":13215,"subject_name":"Higher education"},{"subject_id":13516,"subject_name":"Historic sites and heritage areas"},{"subject_id":13217,"subject_name":"Homelessness and emergency shelter"},{"subject_id":13219,"subject_name":"Housing and community development funding"},{"subject_id":22125,"subject_name":"Housing discrimination"},{"subject_id":13220,"subject_name":"Housing finance and home ownership"},{"subject_id":13221,"subject_name":"Housing for the elderly and disabled"},{"subject_id":13403,"subject_name":"Immigration status and procedures"},{"subject_id":13228,"subject_name":"Indian social and development programs"},{"subject_id":20694,"subject_name":"Insects"},{"subject_id":13614,"subject_name":"Intellectual property"},{"subject_id":13842,"subject_name":"Interagency Council on Homelessness"},{"subject_id":13368,"subject_name":"Internal Revenue Service (IRS)"},{"subject_id":13235,"subject_name":"Latin America"},{"subject_id":13236,"subject_name":"Law enforcement administration and funding"},{"subject_id":13469,"subject_name":"Law enforcement officers"},{"subject_id":13552,"subject_name":"Livestock"},{"subject_id":13238,"subject_name":"Low- and moderate-income housing"},{"subject_id":13554,"subject_name":"Mammals"},{"subject_id":13335,"subject_name":"Marine and coastal resources, fisheries"},{"subject_id":13360,"subject_name":"Marine and inland water transportation"},{"subject_id":13336,"subject_name":"Marine pollution"},{"subject_id":13555,"subject_name":"Maryland"},{"subject_id":13607,"subject_name":"Meat"},{"subject_id":13588,"subject_name":"Members of Congress"},{"subject_id":13893,"subject_name":"Merit Systems Protection Board"},{"subject_id":13243,"subject_name":"Mexico"},{"subject_id":20569,"subject_name":"Military assistance, sales, and agreements"},{"subject_id":13244,"subject_name":"Military facilities and property"},{"subject_id":13449,"subject_name":"Military operations and strategy"},{"subject_id":13773,"subject_name":"Motor carriers"},{"subject_id":13386,"subject_name":"National Archives and Records Administration"},{"subject_id":13791,"subject_name":"National Credit Union Administration"},{"subject_id":13774,"subject_name":"National Railroad Passenger Corporation (Amtrak)"},{"subject_id":13798,"subject_name":"National Transportation Safety Board (NTSB)"},{"subject_id":13442,"subject_name":"Natural disasters"},{"subject_id":13748,"subject_name":"Neighborhood Reinvestment Corporation"},{"subject_id":13315,"subject_name":"Nutrition and diet"},{"subject_id":13855,"subject_name":"Office of Government Ethics"},{"subject_id":13770,"subject_name":"Office of Personnel Management (OPM)"},{"subject_id":13811,"subject_name":"Office of Special Counsel"},{"subject_id":13256,"subject_name":"Oil and gas"},{"subject_id":13257,"subject_name":"Parks, recreation areas, trails"},{"subject_id":13392,"subject_name":"Pipelines"},{"subject_id":13426,"subject_name":"Pollution liability"},{"subject_id":81059,"subject_name":"Privacy and Civil Liberties Oversight Board"},{"subject_id":13261,"subject_name":"Public housing"},{"subject_id":13262,"subject_name":"Public transit"},{"subject_id":13265,"subject_name":"Railroads"},{"subject_id":13267,"subject_name":"Research administration and funding"},{"subject_id":13268,"subject_name":"Research and development"},{"subject_id":13271,"subject_name":"Roads and highways"},{"subject_id":13272,"subject_name":"Rural conditions and development"},{"subject_id":13749,"subject_name":"Saint Lawrence Seaway"},{"subject_id":13666,"subject_name":"Securities and Exchange Commission (SEC)"},{"subject_id":13857,"subject_name":"Selective Service System"},{"subject_id":13275,"subject_name":"Small Business Administration"},{"subject_id":13276,"subject_name":"Small business"},{"subject_id":13281,"subject_name":"Solid waste and recycling"},{"subject_id":13762,"subject_name":"Specialized courts"},{"subject_id":13286,"subject_name":"Student aid and college costs"},{"subject_id":13643,"subject_name":"Surface Transportation Board"},{"subject_id":13319,"subject_name":"Tax administration and collection, taxpayers"},{"subject_id":13431,"subject_name":"Terrorism"},{"subject_id":13573,"subject_name":"Texas"},{"subject_id":13416,"subject_name":"Trade restrictions"},{"subject_id":13291,"subject_name":"Transportation programs funding"},{"subject_id":13292,"subject_name":"Transportation safety and security"},{"subject_id":13357,"subject_name":"U.S. Postal Service"},{"subject_id":13648,"subject_name":"User charges and fees"},{"subject_id":13382,"subject_name":"Veterans' loans, housing, homeless programs"},{"subject_id":13577,"subject_name":"Virginia"},{"subject_id":13394,"subject_name":"Water use and supply"},{"subject_id":13301,"subject_name":"Wilderness and natural areas, wildlife refuges, wild rivers, habitats"},{"subject_id":13337,"subject_name":"Wildlife conservation and habitat protection"},{"subject_id":13302,"subject_name":"Women's health"},{"subject_id":13131,"subject_name":"Air quality"}],"texts":[{"doc_id":1867609,"date":"2019-01-23","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HJR31\/id\/1867609","state_link":"https:\/\/www.congress.gov\/116\/bills\/hjres31\/BILLS-116hjres31ih.pdf","text_size":247942,"text_hash":"81e396286a2f11625e69d00d1856bac0"},{"doc_id":1872130,"date":"2019-01-24","type":"Engrossed","type_id":4,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HJR31\/id\/1872130","state_link":"https:\/\/www.congress.gov\/116\/bills\/hjres31\/BILLS-116hjres31eh.pdf","text_size":119236,"text_hash":"74dc17ac15d814ecd4c114942bc27c9a"},{"doc_id":1874250,"date":"2019-01-25","type":"Amended","type_id":3,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HJR31\/id\/1874250","state_link":"https:\/\/www.congress.gov\/116\/bills\/hjres31\/BILLS-116hjres31eas.pdf","text_size":119848,"text_hash":"7b315d6f92f1354f6c22a29c9c2067a1"},{"doc_id":1912853,"date":"2019-02-15","type":"Enrolled","type_id":5,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HJR31\/id\/1912853","state_link":"https:\/\/www.congress.gov\/116\/bills\/hjres31\/BILLS-116hjres31enr.pdf","text_size":1248811,"text_hash":"80bf554a5de3c92e43cedc624778ea1e"}],"votes":[{"roll_call_id":786132,"date":"2019-01-24","desc":"On motion to recommit with instructions RC# 50","yea":200,"nay":214,"nv":18,"absent":0,"total":432,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HJR31\/id\/786132","state_link":"https:\/\/clerk.house.gov\/Votes\/201950"},{"roll_call_id":786133,"date":"2019-01-24","desc":"On passage RC# 51","yea":231,"nay":180,"nv":21,"absent":0,"total":432,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HJR31\/id\/786133","state_link":"https:\/\/clerk.house.gov\/Votes\/201951"},{"roll_call_id":801010,"date":"2019-02-14","desc":"On agreeing to the conference report RC# 87","yea":300,"nay":128,"nv":4,"absent":0,"total":432,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HJR31\/id\/801010","state_link":"https:\/\/clerk.house.gov\/Votes\/201987"},{"roll_call_id":801289,"date":"2019-02-14","desc":"Cloture on the conference report RC# 25","yea":84,"nay":15,"nv":1,"absent":0,"total":100,"passed":1,"chamber":"S","chamber_id":115,"url":"https:\/\/legiscan.com\/US\/rollcall\/HJR31\/id\/801289","state_link":"https:\/\/www.senate.gov\/legislative\/LIS\/roll_call_votes\/vote1161\/vote_116_1_00025.xml"},{"roll_call_id":801290,"date":"2019-02-14","desc":"Senate agreed to conference report RC# 26","yea":83,"nay":16,"nv":1,"absent":0,"total":100,"passed":1,"chamber":"S","chamber_id":115,"url":"https:\/\/legiscan.com\/US\/rollcall\/HJR31\/id\/801290","state_link":"https:\/\/www.senate.gov\/legislative\/LIS\/roll_call_votes\/vote1161\/vote_116_1_00026.xml"}],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"type":"Hearing","date":"2019-01-22","time":"17:00","location":"H-313 CAPITOL","description":"House Committee on Rules Hearing"},{"type_id":1,"type":"Hearing","date":"2019-01-30","time":"13:30","location":"HC-5 CAPITOL","description":"House Committee on Appropriations Hearing"},{"type_id":1,"type":"Hearing","date":"2019-02-14","time":"17:00","location":"H-313 CAPITOL","description":"House Committee on Rules Hearing"}]}}