{"bill":{"bill_id":1257732,"change_hash":"9f9d5ea3daa08edd02652fff0aef214d","session_id":1658,"session":{"session_id":1658,"state_id":52,"year_start":2019,"year_end":2020,"prefile":0,"sine_die":1,"prior":1,"special":0,"session_tag":"Regular Session","session_title":"2019-2020 Regular Session","session_name":"116th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/SB1379\/2019","state_link":"https:\/\/www.congress.gov\/bill\/116th-congress\/senate-bill\/1379\/all-info","completed":1,"status":4,"status_date":"2019-06-24","progress":[{"date":"2019-05-08","event":1},{"date":"2019-05-08","event":9},{"date":"2019-05-20","event":2},{"date":"2019-06-13","event":3},{"date":"2019-06-24","event":8},{"date":"2019-06-24","event":4}],"state":"US","state_id":52,"bill_number":"SB1379","bill_type":"B","bill_type_id":"1","body":"S","body_id":115,"current_body":"S","current_body_id":115,"title":"Pandemic and All-Hazards Preparedness and Advancing Innovation Act of 2019","description":"Reauthorizes, revises, and establishes several programs and entities relating to public health emergency preparedness and response. TITLE I--STRENGTHENING THE NATIONAL HEALTH SECURITY STRATEGY(Sec. 101) This section expands the National Health Security Strategy requirements to address the prevention of plant and animal disease and evaluate potential health security threats from abroad. TITLE II--IMPROVING PREPAREDNESS AND RESPONSE(Sec. 201) This section reauthorizes through FY2023 and revises the Public Health Emergency Preparedness cooperative-agreement program administered by the Centers for Disease Control and Prevention (CDC) to include evaluations using evidence-based benchmarks and objective standards.(Sec. 202) This section reauthorizes through FY2023 and revises the Hospital Preparedness Program administered by the Office of the Assistant Secretary for Preparedness and Response (ASPR) to require applicants for cooperative agreements under the program to describe the applicant's approach for coordinating services and integrating health data.(Sec. 203) This section establishes federal guidelines for regional health care facilities' response to public health emergencies.(Sec. 204) This section establishes a grant program for eligible trauma centers to train and support military trauma care providers at such centers.(Sec. 205) This section reauthorizes through FY2023 and revises the CDC situational awareness and biosurveillance programs to, among other things, coordinate among agencies, convene a public meeting, develop and implement a strategic plan, and appoint highly-qualified professionals to carry out such programs.(Sec. 206) This section expands the available uses of the Public Health Emergency Fund to anticipate and respond to public health emergencies.(Sec. 207) This section reauthorizes through FY2023 and revises the Emergency System for Advance Registration of Volunteer Health Professionals (ESAR-VHP), including requiring the ASPR to make available information about state mechanisms for waiving the licensing requirements for applicable health professionals during a public health emergency. (Sec. 208) This section limits the liability of certain health professionals to the state laws in which the alleged liable act or omission occurred. The section also requires the Government Accountability Office (GAO) to study the availability of health care providers under the ESAR-VHP.(Sec. 209) This section requires the Department of Health and Human Services (HHS) to report about the adequacy of the national blood supply in the case of a public health emergency, the recruitment of blood donors, and other procedures related to the safety and reliability of the national blood supply.(Sec. 210) This section requires HHS to contract with an appropriate entity to evaluate and report on the public health preparedness and response capabilities of medical and health care facilities nationwide. TITLE III--REACHING ALL COMMUNITIES(Sec. 301) This section reauthorizes through FY2023 and revises the National Disaster Medical System to include a review of the system's medical surge capacity, the available workforce, the capacity of the workforce to respond to public health emergencies and other hazards, the effectiveness of recruiting, and other potential gaps in the workforce.The section also provides specified death benefits for individuals performing official duties under the National Disaster Medical System in response to a public health emergency or other hazardous activity. Additionally, the section reauthorizes through FY2023 the Epidemic Intelligence Service fellowship program and reduces the term of service under the program from three to two years. (Sec. 302) This section addresses the logistical support requirements of the ASPR and permits the ASPR to study factors related to the delivery of medical countermeasures, such as vaccines, during a public health emergency.(Sec. 303) This section addresses provisions related to the consideration of at-risk individuals in developing medical countermeasures and the coordination in implementing the biosurveillance network for emerging public health threats. (Sec. 304) This section provides statutory authority for the Children's Preparedness Unit within the CDC. (Sec. 305) This section reauthorizes through FY2023 and revises the National Advisory Committee on Children and Disasters to require specified nonfederal members, expand the permissible total number of members from 15 to 25, and establish specific terms of appointment, among other changes.The section also establishes the National Advisory Committee on Seniors and Disasters and the National Advisory Committee on Individuals with Disabilities and Disasters.(Sec. 306) This section requires HHS to issue guidance for specified public health workforce participation in operational exercises related to all-hazards medical and public health preparedness and response. TITLE IV--PRIORITIZING A THREAT-BASED APPROACH (Sec. 401) This section requires the ASPR to coordinate with relevant federal agencies to maintain a current assessment of national security threats and inform preparedness and response capabilities based on the range of threats that could result in a public health emergency.(Sec. 402) This section provides statutory authority for the Public Health Emergency Medical Countermeasures Enterprise, which supports the research, development, procurement, and distribution of countermeasures against public health threats.(Sec. 403) This section reauthorizes through FY2023 the Strategic National Stockpile and expands HHS's annual threat-based review process to include, among other things, submitting such review to specified congressional committees and providing explanations for modifications to the procurement of countermeasures for the stockpile.(Sec. 404) This section provides for the Biomedical Advanced Research and Development Authority (BARDA) and the ASPR to develop strategic initiatives to address national security threats. (Sec. 405) This section requires HHS to report on the implementation of the recommendations of the Federal Experts Security Advisory Panel with respect to biological agents and toxins that pose a threat to public health. TITLE V--INCREASING COMMUNICATION IN MEDICAL COUNTERMEASURE ADVANCED RESEARCH AND DEVELOPMENT(Sec. 501) This section expands the requirements of the ASPR with respect to the annual countermeasure budget plan.(Sec. 502) This section requires the Department of Homeland Security to annually notify specified congressional committees about current material threat determinations.(Sec. 503) This section requires the Food and Drug Administration to publish information on its website about regulatory management plans with respect to countermeasures.(Sec. 504) This section reauthorizes through FY2028 the BioShield Special Reserve Fund, which supports the research and development of countermeasures. The section also reauthorizes through FY2023 the Biodefense Medical Countermeasure Development Fund, which supports BARDA.(Sec. 505) This section provides statutory authority for the Presidential Advisory Council on Combating Antibiotic-Resistant Bacteria. TITLE VI--ADVANCING TECHNOLOGIES FOR MEDICAL COUNTERMEASURES(Sec. 601) This section modifies administrative procedures related to medical countermeasures and vaccine development.(Sec. 602) This section expands the authority of BARDA to enter into certain transactions to carry out projects.(Sec. 603) This section specifies procedures related to a master file containing information relevant to the development, authorization, and manufacture of countermeasures or qualified pandemic or epidemic products.(Sec. 604) This section requires the GAO to study and report on the requirements related to the use of animal models in the development of medical countermeasures. (Sec. 605) This section requires HHS to convene relevant representatives to discuss and report on, among other things, the potential role of genomic engineering technologies in advancing national health security.(Sec. 606) This section requires HHS to report on international coordination during recent public health emergencies to develop qualifies pandemic or epidemic products. (Sec. 607) This section reauthorizes and modifies the Mosquito Abatement for Safety and Health Program. The section also reauthorizes the Epidemiology and Laboratory Capacity Grant Program and expands such program to include surveillance of, and response to, diseases transmitted by mosquitos and other living organisms. TITLE VII--MISCELLANEOUS PROVISIONS(Sec. 701) This section extends through FY2023 specified programs including the Department of Veterans Affairs emergency preparedness program and the tracking and distribution of vaccines during an influenza pandemic.(Sec. 702) This section amends the disclosure requirements for information relating to the National Strategic Stockpile of medical countermeasures.(Sec. 703) This section requires HHS to develop a strategy to address cybersecurity threats to national health security.(Sec. 704) This section requires HHS and other relevant agencies to develop a strategy and report about efforts to reunify with their parents children located in HHS facilities after separation at the U.S.-Mexico border as a result of the changes in immigration enforcement policy announced by the Department of Justice on April 6, 2018.","pending_committee_id":0,"committee":[],"referrals":[{"date":"2019-05-08","committee_id":2328,"chamber":"S","chamber_id":115,"name":"Health, Education, Labor, And Pensions"}],"history":[{"date":"2019-05-08","action":"Read twice and referred to the Committee on Health, Education, Labor, and Pensions.","chamber":"S","chamber_id":115,"importance":1},{"date":"2019-05-16","action":"Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent. (consideration: CR S2929-2946)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-05-16","action":"Passed Senate without amendment by Voice Vote. (text: CR S2930-2946)","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-05-20","action":"Message on Senate action sent to the House.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-05-20","action":"Received in the House.","chamber":"H","chamber_id":114,"importance":1},{"date":"2019-05-20","action":"Held at the desk.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-06-04","action":"Ms. Eshoo moved to suspend the rules and pass the bill.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-06-04","action":"Considered under suspension of the rules. (consideration: CR H4245-4265)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-06-04","action":"DEBATE - The House proceeded with forty minutes of debate on S. 1379.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-06-04","action":"On motion to suspend the rules and pass the bill Agreed to by voice vote. (text: CR H4245-4262)","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-06-04","action":"Motion to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2019-06-13","action":"Presented to President.","chamber":"S","chamber_id":115,"importance":1},{"date":"2019-06-24","action":"Signed by President.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-06-24","action":"Became Public Law No: 116-22. (TXT | PDF)","chamber":"S","chamber_id":115,"importance":1}],"sponsors":[{"people_id":9486,"person_hash":"1riyfn00","party_id":"2","state_id":52,"party":"R","role_id":2,"role":"Sen","name":"Richard Burr","first_name":"Richard","middle_name":"","last_name":"Burr","suffix":"","nickname":"","district":"SD-NC","ftm_eid":6860429,"votesmart_id":21787,"opensecrets_id":"N00002221","knowwho_pid":158938,"ballotpedia":"Richard_Burr","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":9403,"person_hash":"dbwfjn2h","party_id":"1","state_id":52,"party":"D","role_id":2,"role":"Sen","name":"Robert Casey","first_name":"Robert","middle_name":"P.","last_name":"Casey","suffix":"Jr.","nickname":"Bob","district":"SD-PA","ftm_eid":5967054,"votesmart_id":2541,"opensecrets_id":"N00027503","knowwho_pid":240529,"ballotpedia":"Robert_Casey_(Pennsylvania)","sponsor_type_id":2,"sponsor_order":2,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":9428,"person_hash":"9owmjihh","party_id":"2","state_id":52,"party":"R","role_id":2,"role":"Sen","name":"Lamar Alexander","first_name":"Lamar","middle_name":"","last_name":"Alexander","suffix":"","nickname":"","district":"SD-TN","ftm_eid":2116345,"votesmart_id":15691,"opensecrets_id":"N00009888","knowwho_pid":211704,"ballotpedia":"Lamar_Alexander","sponsor_type_id":2,"sponsor_order":3,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":9431,"person_hash":"y4pijgni","party_id":"1","state_id":52,"party":"D","role_id":2,"role":"Sen","name":"Patty Murray","first_name":"Patty","middle_name":"","last_name":"Murray","suffix":"","nickname":"","district":"SD-WA","ftm_eid":18930579,"votesmart_id":53358,"opensecrets_id":"N00007876","knowwho_pid":165286,"ballotpedia":"Patty_Murray","sponsor_type_id":2,"sponsor_order":4,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"HB269","sast_bill_id":1142100},{"type_id":8,"type":"Related","sast_bill_number":"SB11","sast_bill_id":1137318}],"subjects":[{"subject_id":13304,"subject_name":"Health"},{"subject_id":13127,"subject_name":"Advisory bodies"},{"subject_id":13128,"subject_name":"Aging"},{"subject_id":13604,"subject_name":"Blood and blood diseases"},{"subject_id":13141,"subject_name":"Centers for Disease Control and Prevention (CDC)"},{"subject_id":20850,"subject_name":"Chemical and biological weapons"},{"subject_id":13322,"subject_name":"Civil actions and liability"},{"subject_id":13146,"subject_name":"Congressional oversight"},{"subject_id":13156,"subject_name":"Department of Health and Human Services"},{"subject_id":13439,"subject_name":"Disaster relief and insurance"},{"subject_id":13308,"subject_name":"Emergency medical services and trauma care"},{"subject_id":13472,"subject_name":"Emergency planning and evacuation"},{"subject_id":13378,"subject_name":"Federal-Indian relations"},{"subject_id":13198,"subject_name":"Government employee pay, benefits, personnel management"},{"subject_id":22688,"subject_name":"Government studies and investigations"},{"subject_id":13207,"subject_name":"Health care coverage and access"},{"subject_id":13209,"subject_name":"Health facilities and institutions"},{"subject_id":13210,"subject_name":"Health information and medical records"},{"subject_id":13211,"subject_name":"Health personnel"},{"subject_id":13212,"subject_name":"Health programs administration and funding"},{"subject_id":13213,"subject_name":"Health promotion and preventive care"},{"subject_id":13706,"subject_name":"Infectious and parasitic diseases"},{"subject_id":13231,"subject_name":"Intergovernmental relations"},{"subject_id":13237,"subject_name":"Long-term, rehabilitative, and terminal care"},{"subject_id":13240,"subject_name":"Medical education"},{"subject_id":13241,"subject_name":"Medical research"},{"subject_id":13803,"subject_name":"Military education and training"},{"subject_id":13602,"subject_name":"Military medicine"},{"subject_id":13449,"subject_name":"Military operations and strategy"},{"subject_id":20766,"subject_name":"Military readiness"},{"subject_id":13442,"subject_name":"Natural disasters"},{"subject_id":13652,"subject_name":"Public participation and lobbying"},{"subject_id":13280,"subject_name":"Social work, volunteer service, charitable organizations"},{"subject_id":13285,"subject_name":"State and local government operations"},{"subject_id":13431,"subject_name":"Terrorism"}],"texts":[{"doc_id":2019695,"date":"2019-05-16","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/SB1379\/id\/2019695","state_link":"https:\/\/www.congress.gov\/116\/bills\/s1379\/BILLS-116s1379is.pdf","text_size":580839,"text_hash":"b29514951a838d17205412a2742e016f"},{"doc_id":2020317,"date":"2019-05-17","type":"Engrossed","type_id":4,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/SB1379\/id\/2020317","state_link":"https:\/\/www.congress.gov\/116\/bills\/s1379\/BILLS-116s1379es.pdf","text_size":440550,"text_hash":"0dc9d79717975d61fce24fa684e81ad4"},{"doc_id":2034261,"date":"2019-06-05","type":"Enrolled","type_id":5,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/SB1379\/id\/2034261","state_link":"https:\/\/www.congress.gov\/116\/bills\/s1379\/BILLS-116s1379enr.pdf","text_size":327905,"text_hash":"b65f27cb2cb4c21b0e63ee505fe7e409"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}