{"bill":{"bill_id":1262194,"change_hash":"00a87ab530c6196e30f5a1913b0fddc6","session_id":1658,"session":{"session_id":1658,"state_id":52,"year_start":2019,"year_end":2020,"prefile":0,"sine_die":1,"prior":1,"special":0,"session_tag":"Regular Session","session_title":"2019-2020 Regular Session","session_name":"116th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/SB1507\/2019","state_link":"https:\/\/www.congress.gov\/bill\/116th-congress\/senate-bill\/1507\/all-info","completed":0,"status":1,"status_date":"2019-05-16","progress":[{"date":"2019-05-16","event":1},{"date":"2019-05-16","event":9},{"date":"2019-06-19","event":10}],"state":"US","state_id":52,"bill_number":"SB1507","bill_type":"B","bill_type_id":"1","body":"S","body_id":115,"current_body":"S","current_body_id":115,"title":"PFAS Release Disclosure Act PFAS Release Disclosure and Protection Act of 2019","description":"Requires regulation of perfluoroalkyl and polyfluoroalkyl substances, commonly known as PFAS, in relation to safe drinking water and the management of toxic chemicals. These substances are man-made and may have adverse human health effects. A variety of products contain the compounds, such as nonstick cookware or weatherproof clothing. (Sec. 101) This section requires specified PFAS to be immediately included in the Toxics Release Inventory (TRI) of the Environmental Protection Agency (EPA). In general, PFAS that are being assessed for toxicity value, subject to the significant new use rule, or subject to an existing or future significant new use rule must be added to the TRI after finalization of the relevant assessment. The bill also implements a 100-pound threshold for purposes of reporting such PFAS that are included in the TRI. The EPA must determine whether a revision of the threshold is warranted in five years. The EPA must determine within two years whether specified PFAS, such as perfluorobutanesulfonic acid, warrant inclusion in the TRI. With regard to PFAS that are subject to a claim of a person of protection from disclosure due to confidential business information, the EPA must review that claim and require the person to reassert and substantiate that claim. If the substance qualifies for protection from disclosure, the EPA must include the substance on the TRI in a manner that does not disclose the protected information. Owners or operators of facilities that manufacture, process, or use a PFAS included on the TRI per this bill must complete a toxic chemical release form for each chemical that was manufactured, processed, or otherwise used at certain thresholds. (Sec. 201) This section revises requirements for national primary drinking water regulations, including by requiring the EPA to establish standards for the level of PFAS in drinking water. The EPA must add alternative procedures for monitoring PFAS in drinking water after validating such procedures are equally effective to current procedures. Under the bill, the EPA is authorized to include PFAS on the list of contaminants for consideration of regulation. The EPA must tailor monitoring requirements for public water systems that do not detect or are reliably and consistently below the maximum containment level for PFAS subject to regulation. Additional substances must be evaluated by the EPA for inclusion in the national primary drinking water regulation after a specified time frame. The bill requires the EPA to publish a health advisory for PFAS after a specified time frame. This requirement may be waived in instances where the EPA determines there is a substantial likelihood the PFAS will not occur in drinking water. (Sec. 202) This section requires the EPA to include PFAS that can be methodically measured on the list of unregulated contaminants to be monitored in relation to drinking water. Such PFAS will not count toward the limit of 30 unregulated contaminants to be monitored by public water systems. The requirement shall be adaptable dependent on the population the public water system serves. (Sec. 203) This section prohibits the EPA from imposing financial penalties for the violation of a national primary drinking water regulation with respect to PFAS earlier than five years after the date on which the EPA has promulgated a PFAS drinking water regulation. (Sec. 204) This section authorizes the use of drinking water state revolving funds for the purpose of addressing emerging contaminants, including PFAS. (Sec. 302) This section sets forth requirements for detecting and sampling PFAS. Specifically, the U.S. Geological Survey (USGS) must establish a performance standard for the detection of PFAS. (Sec. 303) Using such standard, the USGS must carry out a nationwide sampling to determine the concentration of PFAS in estuaries, lakes, streams, springs, wells, wetlands, rivers, aquifers, and soil. (Sec. 304) The sampling data must then be used to inform and enhance assessments of exposure, likely health and environmental impacts, and remediation priorities. (Sec. 401) This section addresses contaminants of emerging concern (emerging contaminants), which are not regulated under a national primary drinking water regulation and may have an adverse effect on human health. (Sec. 402) The EPA must review federal efforts to (1) identify, monitor, and assist in the development of treatment methods for emerging contaminants; and (2) assist states in responding to the human health risks posed by those contaminants. In addition, the EPA must establish a strategic plan for improving those efforts. The EPA and the Department of Health and Human Services must jointly establish an interagency working group to coordinate federal activities that identify and analyze the public health effects of emerging contaminants. The Office of Science and Technology Policy must establish a National Emerging Contaminant Research Initiative to (1) improve the identification, analysis, monitoring, and treatment methods of emerging contaminants; and (2) support the implementation of its cross-agency plan for addressing research gaps related to detecting, assessing exposure to, and identifying the adverse health effects of such contaminants. Specified federal agencies must make grants for research proposals that are likely to result in significant progress toward achieving the plan's objectives. The EPA must (1) report on actions it may take to increase technical assistance and support for states with respect to emerging contaminants in drinking water samples, and (2) develop a program to provide technical assistance and support to states for the testing and analysis of emerging contaminants. (Sec. 501) This section authorizes the Department of Defense to expend funds for the purpose of addressing ground or surface water contamination by a PFAS by entering into a grant agreement or contract with a local water authority or a state, local, or tribal government. (Sec. 502) This section requires each person who has manufactured a PFAS in any year since January 1, 2006, to submit a report to the EPA. (Sec. 503) This section directs the EPA to take final action by June 22, 2020, on the significant new use rule for long-chain PFAS within the proposed rule titled Long-Chain Perfluoroalkyl Carboxylate and Perfluoroalkyl Sulfonate Chemical Substances; Significant New Use Rule. (Sec. 504) This section directs the EPA to publish guidance at least once every three years on the destruction and disposal of PFAS and materials containing PFAS, such as aqueous film-forming foam. (Sec. 505) This section requires the EPA to further examine the effects of PFAS on human health and the environment and to make any findings publicly available. The EPA must also develop a process for prioritizing which PFAS should be subject to additional research. In addition, the EPA must develop new tools to characterize and identify PFAS in the environment and evaluate approaches for the remediation of contamination. Finally, the EPA must develop and implement new tools and materials to communicate with the public about PFAS.","pending_committee_id":0,"committee":[],"referrals":[{"date":"2019-05-16","committee_id":2325,"chamber":"S","chamber_id":115,"name":"Environment And Public Works"}],"history":[{"date":"2019-05-16","action":"Read twice and referred to the Committee on Environment and Public Works.","chamber":"S","chamber_id":115,"importance":1},{"date":"2019-06-19","action":"Committee on Environment and Public Works. Ordered to be reported with an amendment in the nature of a substitute favorably.","chamber":"S","chamber_id":115,"importance":1},{"date":"2019-06-19","action":"Committee on Environment and Public Works. Reported by Senator Barrasso with an amendment in the nature of a substitute. Without written report.","chamber":"S","chamber_id":115,"importance":0},{"date":"2019-06-19","action":"Placed on Senate Legislative Calendar under General Orders. Calendar No. 119.","chamber":"S","chamber_id":115,"importance":0}],"sponsors":[{"people_id":9212,"person_hash":"l1ed938k","party_id":"2","state_id":52,"party":"R","role_id":2,"role":"Sen","name":"Shelley Capito","first_name":"Shelley","middle_name":"Moore","last_name":"Capito","suffix":"","nickname":"","district":"HD-WV-2","ftm_eid":6651319,"votesmart_id":11701,"opensecrets_id":"N00009771","knowwho_pid":200084,"ballotpedia":"Shelley_Moore_Capito","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":9047,"person_hash":"qm3c1xjn","party_id":"1","state_id":52,"party":"D","role_id":2,"role":"Sen","name":"Kirsten Gillibrand","first_name":"Kirsten","middle_name":"E.","last_name":"Gillibrand","suffix":"","nickname":"","district":"HD-NY-20","ftm_eid":1577524,"votesmart_id":65147,"opensecrets_id":"N00027658","knowwho_pid":248345,"ballotpedia":"Kirsten_Gillibrand","sponsor_type_id":2,"sponsor_order":2,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":9425,"person_hash":"dayilu15","party_id":"1","state_id":52,"party":"D","role_id":2,"role":"Sen","name":"Thomas Carper","first_name":"Thomas","middle_name":"R.","last_name":"Carper","suffix":"","nickname":"","district":"SD-DE","ftm_eid":8428238,"votesmart_id":22421,"opensecrets_id":"N00012508","knowwho_pid":205484,"ballotpedia":"Tom_Carper","sponsor_type_id":2,"sponsor_order":3,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"SB1790","sast_bill_id":1267965},{"type_id":2,"type":"Similar To","sast_bill_number":"HR758","sast_bill_id":1288053},{"type_id":8,"type":"Related","sast_bill_number":"HB5361","sast_bill_id":1287845},{"type_id":8,"type":"Related","sast_bill_number":"HB1976","sast_bill_id":1246611},{"type_id":8,"type":"Related","sast_bill_number":"SB950","sast_bill_id":1246509},{"type_id":8,"type":"Related","sast_bill_number":"SB1251","sast_bill_id":1255602}],"subjects":[{"subject_id":13330,"subject_name":"Environmental protection"},{"subject_id":13126,"subject_name":"Administrative law and regulatory procedures"},{"subject_id":13131,"subject_name":"Air quality"},{"subject_id":13413,"subject_name":"Business records"},{"subject_id":13146,"subject_name":"Congressional oversight"},{"subject_id":13156,"subject_name":"Department of Health and Human Services"},{"subject_id":13472,"subject_name":"Emergency planning and evacuation"},{"subject_id":13182,"subject_name":"Environmental Protection Agency (EPA)"},{"subject_id":13333,"subject_name":"Environmental assessment, monitoring, research"},{"subject_id":13740,"subject_name":"Environmental health"},{"subject_id":13641,"subject_name":"Environmental regulatory procedures"},{"subject_id":13184,"subject_name":"Executive agency funding and structure"},{"subject_id":13200,"subject_name":"Government information and archives"},{"subject_id":22688,"subject_name":"Government studies and investigations"},{"subject_id":13205,"subject_name":"Hazardous wastes and toxic substances"},{"subject_id":13701,"subject_name":"Manufacturing"},{"subject_id":13244,"subject_name":"Military facilities and property"},{"subject_id":13258,"subject_name":"Performance measurement"},{"subject_id":13268,"subject_name":"Research and development"},{"subject_id":13745,"subject_name":"Soil pollution"},{"subject_id":13281,"subject_name":"Solid waste and recycling"},{"subject_id":13284,"subject_name":"State and local finance"},{"subject_id":13298,"subject_name":"Water quality"},{"subject_id":13394,"subject_name":"Water use and supply"},{"subject_id":13202,"subject_name":"Government lending and loan guarantees"},{"subject_id":13880,"subject_name":"Freedom of information"},{"subject_id":13807,"subject_name":"Trade secrets and economic espionage"},{"subject_id":13150,"subject_name":"Defense spending"},{"subject_id":13188,"subject_name":"Fires"},{"subject_id":13512,"subject_name":"Industrial facilities"},{"subject_id":13231,"subject_name":"Intergovernmental relations"},{"subject_id":13420,"subject_name":"Lakes and rivers"},{"subject_id":13285,"subject_name":"State and local government operations"},{"subject_id":13427,"subject_name":"Wetlands"}],"texts":[{"doc_id":2032963,"date":"2019-06-03","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/SB1507\/id\/2032963","state_link":"https:\/\/www.congress.gov\/116\/bills\/s1507\/BILLS-116s1507is.pdf","text_size":137743,"text_hash":"282684989b44f57794508d9b4838abb8"},{"doc_id":2042122,"date":"2019-06-20","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/SB1507\/id\/2042122","state_link":"https:\/\/www.congress.gov\/116\/bills\/s1507\/BILLS-116s1507rs.pdf","text_size":485521,"text_hash":"dd2a0d35fdb7f6be51cfa7db4acb00a4"}],"votes":[],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"type":"Hearing","date":"2019-06-19","time":"09:30","location":"SD-406","description":"Senate Environment and Public Works Hearing"}]}}