{"bill":{"bill_id":1882580,"change_hash":"5230a035bb701a64610a7c70236ce399","session_id":2041,"session":{"session_id":2041,"state_id":52,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"118th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/HB8771\/2023","state_link":"https:\/\/www.congress.gov\/bill\/118th-congress\/house-bill\/8771\/all-info","completed":0,"status":2,"status_date":"2024-07-08","progress":[{"date":"2024-06-14","event":1},{"date":"2024-07-08","event":2}],"state":"US","state_id":52,"bill_number":"HB8771","bill_type":"B","bill_type_id":"1","body":"H","body_id":114,"current_body":"S","current_body_id":115,"title":"Department of State, Foreign Operations, and Related Programs Appropriations Act, 2025","description":"Making appropriations for the Department of State, foreign operations, and related programs for the fiscal year ending September 30, 2025, and for other purposes.","pending_committee_id":0,"committee":[],"referrals":[],"history":[{"date":"2024-06-14","action":"Introduced in House","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-14","action":"The House Committee on Appropriations reported an original measure, H. Rept. 118-554, by Mr. Diaz-Balart.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-14","action":"Placed on the Union Calendar, Calendar No. 457.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-25","action":"Rules Committee Resolution H. Res. 1316 Reported to House. Rule provides for consideration of H.R. 8774, H.R. 8771 and H.R. 8752. The resolution provides for consideration of H.R. 8774, H.R. 8771, and H.R. 8752, all under a structured rule. The resolution provides for one hour of general debate and one motion to recommit for each bill.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"Considered under the provisions of rule H. Res. 1316. (consideration: CR H4262-4319; text of amendment in the nature of a substitute: CR H4266-4297)","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"Rule provides for consideration of H.R. 8774, H.R. 8771 and H.R. 8752. The resolution provides for consideration of H.R. 8774, H.R. 8771, and H.R. 8752, all under a structured rule. The resolution provides for one hour of general debate and one motion to recommit for each bill.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 1316 and Rule XVIII.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"The Speaker designated the Honorable Randy K. Weber, Sr. to act as Chairman of the Committee.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 8771.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 20 minutes of debate on the Diaz-Balart amendment en bloc.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Brecheen amendment No. 1.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Brecheen amendment No. 1, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Brecheen amendment No. 2.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Brecheen amendment No. 2, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Brecheen amendment No. 3.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Brecheen amendment No. 3, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Burchett amendment No. 4.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Burchett amendment No. 4, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Burchett amendment No. 5.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Burchett amendment No. 6.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Burlison amendment No. 8.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Burchett amendment No. 9.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Burchett amendment No. 9, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment No. 13.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Gosar amendment No. 13, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment No. 14.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Gosar amendment No. 14, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Gosar demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment No. 15.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Gosar amendment No. 15, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Gosar demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment No. 16.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Gosar amendment No. 16, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 18.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Greene (GA) amendment No. 18, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 19.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Greene (GA) amendment No. 19, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Greene (GA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 20.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Greene (GA) amendment No. 20, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Greene (GA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 21.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Hageman amendment No. 21, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 22.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Hageman amendment No. 22, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Issa amendment No. 23.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Issa amendment No. 24.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Lawler amendment No. 32.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Mace amendment No. 35.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Mace amendment No. 35, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Mace demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Mace amendment No. 36.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Mace amendment No. 36, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Mace demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Moskowitz amendment No. 45.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Moskowitz amendment No. 45, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Diaz-Balart demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"Mr. Diaz-Balart moved that the committee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"On motion that the committee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-26","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 8771 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"Considered as unfinished business. (consideration: CR H4326-4354)","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 48.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 49.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 50.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Ogles amendment No. 50, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 54.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 54, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Diaz-Balart demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Ramirez amendment No. 57.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Spartz amendment No. 59.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Spartz amendment No. 59, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Meng demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Steube amendment No. 61.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Steube amendment No. 61, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Issa demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Steube amendment No. 62.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Tenney amendment No. 63.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Tenney amendment No. 63, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Tenney amendment No. 64.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Tenney amendment No. 64, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Tenney demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H.Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Tiffany amendment No. 67.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H.Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Tiffany amendment No. 68.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Tiffany amendment No. 68, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Waltz amendment No. 72.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Waltz amendment No. 72, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Lee (CA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"DEBATE - Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Wilson (SC) amendment No. 75.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Wilson (SC) amendment No. 75, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Wilson (SC) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"Mr. Diaz-Balart moved that the committee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"On motion that the committee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 8771 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"Considered as unfinished business. (consideration: CR H4389-4393)","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 8771.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-27","action":"POSTPONED PROCEEDINGS - Pursuant to clause 1(c) of rule XIX, the Chair announced further proceedings on H.R. 8771 would be postponed.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-28","action":"Pursuant to clause 1(c) of Rule XIX, the House resumed consideration on H.R. 8771.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-28","action":"Considered as unfinished business. (consideration: CR H4424-4426)","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-28","action":"The House adopted the amendments en gros as agreed to by the Committee of the Whole House on the state of the Union.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-28","action":"Ms. Meng moved to recommit to the Committee on Appropriations. (text: CR H4425)","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-28","action":"The previous question on the motion to recommit was ordered pursuant to clause 2(b) of rule XIX.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-28","action":"On motion to recommit Failed by the Yeas and Nays: 200 - 212 (Roll no. 334).","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-28","action":"On passage Passed by the Yeas and Nays: 212 - 200 (Roll no. 335).","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-28","action":"Motion to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-06-28","action":"The Clerk was authorized to correct section numbers, punctuation, and cross references, and to make other necessary technical and conforming corrections in the engrossment of H.R. 8771.","chamber":"H","chamber_id":114,"importance":0},{"date":"2024-07-08","action":"Received in the Senate.","chamber":"S","chamber_id":115,"importance":1},{"date":"2024-09-12","action":"Read twice. Placed on Senate Legislative Calendar under General Orders. Calendar No. 507.","chamber":"S","chamber_id":115,"importance":0}],"sponsors":[{"people_id":9157,"person_hash":"nyixi862","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Mario Diaz-Balart","first_name":"Mario","middle_name":"","last_name":"Diaz-Balart","suffix":"","nickname":"","district":"HD-FL-26","ftm_eid":12999048,"votesmart_id":24312,"opensecrets_id":"N00025337","knowwho_pid":193508,"ballotpedia":"Mario_Diaz-Balart","bioguide_id":"D000600","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"HR1316","sast_bill_id":1883388},{"type_id":8,"type":"Related","sast_bill_number":"SB4797","sast_bill_id":1884949}],"subjects":[{"subject_id":13124,"subject_name":"Economics and public finance"}],"texts":[{"doc_id":3009669,"date":"2024-06-15","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB8771\/id\/3009669","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr8771\/BILLS-118hr8771rh.pdf","text_size":716371,"text_hash":"064be0881d5ce14586167d42562ddfc1","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""},{"doc_id":3013260,"date":"2024-07-02","type":"Engrossed","type_id":4,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB8771\/id\/3013260","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr8771\/BILLS-118hr8771eh.pdf","text_size":582463,"text_hash":"cfbfc5e8e2c07a6677be2146e8f62a1b","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""},{"doc_id":3020997,"date":"2024-09-13","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB8771\/id\/3020997","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr8771\/BILLS-118hr8771pcs.pdf","text_size":696066,"text_hash":"9a946eb872759ddd102f7642f7353e9c","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""}],"votes":[{"roll_call_id":1461442,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Brecheen of Oklahoma Part B Amendment No. 3 RC# 2","yea":164,"nay":244,"nv":0,"absent":29,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461442","state_link":"https:\/\/clerk.house.gov\/Votes\/2024299"},{"roll_call_id":1461443,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Brecheen of Oklahoma Part B Amendment No. 1 RC# 27","yea":164,"nay":246,"nv":0,"absent":27,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461443","state_link":"https:\/\/clerk.house.gov\/Votes\/2024297"},{"roll_call_id":1461444,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Brecheen of Oklahoma Part B Amendment No. 2 RC# 28","yea":180,"nay":227,"nv":0,"absent":30,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461444","state_link":"https:\/\/clerk.house.gov\/Votes\/2024298"},{"roll_call_id":1461445,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Hageman of Wyoming Part B Amendment No. 21 RC# 30","yea":175,"nay":236,"nv":0,"absent":26,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461445","state_link":"https:\/\/clerk.house.gov\/Votes\/2024309"},{"roll_call_id":1461446,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Burchett of Tennessee Part B Amendment No. 4 RC# 300","yea":166,"nay":244,"nv":2,"absent":25,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461446","state_link":"https:\/\/clerk.house.gov\/Votes\/2024300"},{"roll_call_id":1461447,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Gosar of Arizona Part B Amendment No. 13 RC# 302","yea":156,"nay":254,"nv":0,"absent":27,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461447","state_link":"https:\/\/clerk.house.gov\/Votes\/2024302"},{"roll_call_id":1461448,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Gosar of Arizona Part B Amendment No. 14 RC# 303","yea":61,"nay":350,"nv":0,"absent":26,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461448","state_link":"https:\/\/clerk.house.gov\/Votes\/2024303"},{"roll_call_id":1461449,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Gosar of Arizona Part B Amendment No. 15 RC# 304","yea":76,"nay":334,"nv":0,"absent":27,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461449","state_link":"https:\/\/clerk.house.gov\/Votes\/2024304"},{"roll_call_id":1461450,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Gosar of Arizona Part B Amendment No. 16 RC# 305","yea":109,"nay":303,"nv":0,"absent":25,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461450","state_link":"https:\/\/clerk.house.gov\/Votes\/2024305"},{"roll_call_id":1461451,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Greene of Georgia Part B Amendment No. 18 RC# 306","yea":133,"nay":277,"nv":1,"absent":26,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461451","state_link":"https:\/\/clerk.house.gov\/Votes\/2024306"},{"roll_call_id":1461452,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Greene of Georgia Part B Amendment No. 19 RC# 307","yea":70,"nay":342,"nv":0,"absent":25,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461452","state_link":"https:\/\/clerk.house.gov\/Votes\/2024307"},{"roll_call_id":1461453,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Greene of Georgia Part B Amendment No. 20 RC# 308","yea":81,"nay":331,"nv":0,"absent":25,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461453","state_link":"https:\/\/clerk.house.gov\/Votes\/2024308"},{"roll_call_id":1461454,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Hageman of Wyoming Part B Amendment No. 22 RC# 310","yea":187,"nay":225,"nv":0,"absent":25,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461454","state_link":"https:\/\/clerk.house.gov\/Votes\/2024310"},{"roll_call_id":1461455,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Mace of South Carolina Part B Amendment No. 35 RC# 311","yea":163,"nay":249,"nv":0,"absent":25,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461455","state_link":"https:\/\/clerk.house.gov\/Votes\/2024311"},{"roll_call_id":1461456,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Perry of Pennsylvania Part B Amendment No. 54 RC# 315","yea":101,"nay":312,"nv":0,"absent":24,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461456","state_link":"https:\/\/clerk.house.gov\/Votes\/2024315"},{"roll_call_id":1461457,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Spartz of Indiana Part B Amendment No. 59 RC# 316","yea":182,"nay":230,"nv":0,"absent":25,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461457","state_link":"https:\/\/clerk.house.gov\/Votes\/2024316"},{"roll_call_id":1461458,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Steube of Florida Part B Amendment No. 61 RC# 317","yea":103,"nay":308,"nv":0,"absent":26,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461458","state_link":"https:\/\/clerk.house.gov\/Votes\/2024317"},{"roll_call_id":1461459,"date":"2024-06-27","desc":"On Agreeing to the Amendment: Tiffany of Wisconsin Part B Amendment No. 68 RC# 320","yea":149,"nay":259,"nv":0,"absent":29,"total":437,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461459","state_link":"https:\/\/clerk.house.gov\/Votes\/2024320"},{"roll_call_id":1461712,"date":"2024-06-28","desc":"On Motion to Recommit RC# 334","yea":200,"nay":212,"nv":0,"absent":20,"total":432,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461712","state_link":"https:\/\/clerk.house.gov\/Votes\/2024334"},{"roll_call_id":1461713,"date":"2024-06-28","desc":"On Passage RC# 335","yea":212,"nay":200,"nv":0,"absent":20,"total":432,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB8771\/id\/1461713","state_link":"https:\/\/clerk.house.gov\/Votes\/2024335"}],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"event_hash":"9b50d288","type":"Hearing","date":"2024-06-25","time":"14:00","location":"H-313, CAPITOL","description":"House Committee on Rules Hearing"}]}}